[
  {
    "category": "BALANCE_SITTING_STATIC",
    "intervention": "Static Sitting Balance EOB",
    "narrative": "Skilled interventions focused on static sitting balance EOB to re-educate trunk musculature 2/2 weakness and improve [Patient Goal]. Patient completed 5 min of unsupported sitting and 2 min with eyes closed to challenge vestibular/proprioceptive systems. Mod verbal cues were required for upright posture, with tactile cues at trunk to facilitate core engagement."
  },
  {
    "category": "BALANCE_SITTING_STATIC",
    "intervention": "Static Sitting Balance Unsupported",
    "narrative": "Patient completed static sitting balance activities on a mat table to improve [Patient Goal], targeting poor motor control of the trunk. Activities included 4 min of unsupported sitting, narrow BOS progressions, and static holds during UE reaching. Min verbal cues for postural alignment and tactile cues to posterior pelvic tilt/trunk extensors were provided to facilitate an upright midline posture."
  },
  {
    "category": "BALANCE_SITTING_STATIC",
    "intervention": "Static Sitting Balance on Therapy Ball",
    "narrative": "Patient participated in static sitting balance activities on a therapy ball to re-educate postural righting reactions 2/2 deconditioning. Session included 3 min of unsupported sitting to improve [Patient Goal], requiring verbal cues for head/neck positioning and tactile cues to obliques/extensors to facilitate trunk alignment."
  },
  {
    "category": "BALANCE_SITTING_DYNAMIC",
    "intervention": "Dynamic Sitting Balance Reaching",
    "narrative": "Skilled interventions focused on dynamic sitting balance to improve [Patient Goal], given impaired equilibrium reactions. Patient completed 12 reps of seated reaching beyond BOS in all planes and 8 reps of weight shifts with object manipulation. Tactile cues at hips were required to facilitate weight shift control, with min verbal cues for trunk stability."
  },
  {
    "category": "BALANCE_SITTING_DYNAMIC",
    "intervention": "Dynamic Sitting Balance EOB",
    "narrative": "To address significant trunk weakness, Patient completed dynamic sitting balance exercises EOB to improve [Patient Goal]. Activities included 10 reps of functional reaching (simulated grooming/dressing) and 8 reps of seated ball toss. Mod verbal cues for controlled movement and tactile cues to facilitate core activation were necessary."
  },
  {
    "category": "BALANCE_SITTING_DYNAMIC",
    "intervention": "Dynamic Sitting Balance on Ball",
    "narrative": "Patient engaged in dynamic sitting balance exercises on a therapy ball to improve [Patient Goal], addressing core weakness. Session included 10 reps of seated marching on the ball, 12 reps of reaches in multiple planes, and perturbation training. Verbal cues were provided for recovery strategies, with tactile cues for anticipatory adjustments."
  },
  {
    "category": "BALANCE_STANDING_STATIC",
    "intervention": "Static Standing Balance Narrow BOS",
    "narrative": "To improve [Patient Goal] given BLE weakness, Patient completed static standing balance training at a counter. Patient performed 4 reps of 20 sec single leg stance (R/L) with support, 30 sec tandem stance, and 1 min narrow BOS stance. Interventions required tactile cues to facilitate appropriate weight distribution and verbal cues for upright posture to maintain proper alignment."
  },
  {
    "category": "BALANCE_STANDING_STATIC",
    "intervention": "Static Standing Single Leg Balance",
    "narrative": "Patient completed static standing balance exercises to improve [Patient Goal], 2/2 impaired balance. Session involved 3 reps of 30 sec single leg stance progressions (each leg), progressing from eyes open to eyes closed to challenge proprioceptive and vestibular systems. Min verbal cues for hip/ankle strategy use were provided, with SBA and RW nearby for safety."
  },
  {
    "category": "BALANCE_STANDING_STATIC",
    "intervention": "Static Standing Reduced BOS",
    "narrative": "To improve [Patient Goal] given decreased standing endurance, Patient engaged in static standing balance activities. Activities included 2 min of standing with reduced BOS and 3 min of static holds during simulated tasks. Verbal cues for posture and tactile cues to facilitate ankle/hip strategy use were provided."
  },
  {
    "category": "BALANCE_STANDING_DYNAMIC",
    "intervention": "Dynamic Standing Balance Weight Shifts",
    "narrative": "Skilled dynamic standing balance training provided to improve [Patient Goal], given significant fall risk. Patient completed 10 reps of weight shifts in all directions, 12 reps of reaching activities with RW, and 8 reps of stepping patterns. Tactile cues at hips to facilitate proper weight transfer and mod verbal cues for controlled, graded movements were required."
  },
  {
    "category": "BALANCE_STANDING_DYNAMIC",
    "intervention": "Dynamic Standing Balance Multidirectional",
    "narrative": "Dynamic standing balance training provided to improve [Patient Goal], addressing noted balance deficits. Activities included 10 reps each of multidirectional stepping, obstacle navigation, and dual-task activities. Min verbal cues for anticipatory postural adjustments and tactile cues to facilitate reactive strategies were provided."
  },
  {
    "category": "BALANCE_STANDING_DYNAMIC",
    "intervention": "Dynamic Standing Balance Foam/Uneven Surfaces",
    "narrative": "Patient participated in dynamic standing balance activities on foam/uneven surfaces to improve [Patient Goal], targeting impaired balance reactions. Session included 8 trials of standing on foam with perturbations and 3 trials of tandem walking on an uneven surface (10 ft). Mod verbal cues for recovery strategies and SBA for safety were required."
  },
  {
    "category": "POSTURE_TRUNK",
    "intervention": "Postural Control Sitting",
    "narrative": "To improve [Patient Goal] 2/2 chronic poor posture, Patient completed 3 sets of 10 reps of postural control exercises in sitting. Session included mirror feedback training and core activation with biofeedback. Verbal cues for optimal spinal positioning and tactile cues to facilitate scapular retraction were provided."
  },
  {
    "category": "POSTURE_TRUNK",
    "intervention": "Postural Control During ADL Simulation",
    "narrative": "Postural awareness training provided during functional tasks to improve [Patient Goal], 2/2 postural instability. Session included 2 sets of 12 reps of ADL simulation and stabilization exercises, requiring min verbal cues for neutral spine and tactile cues to facilitate trunk engagement."
  },
  {
    "category": "POSTURE_TRUNK",
    "intervention": "Postural Control Training (Pain)",
    "narrative": "Patient participated in 3 sets of 10 reps of postural control exercises to improve [Patient Goal], given chronic back pain. Activities included postural correction training, ergonomic education, and core bracing. Verbal cues for positioning awareness and tactile feedback for proper alignment were provided."
  },
  {
    "category": "POSTURE_TRUNK",
    "intervention": "Trunk Control Supine/Sidelying",
    "narrative": "Patient completed trunk control exercises in supine/sidelying to improve [Patient Goal], targeting motor deficits from spinal cord injury. Activities included 8 reps of segmental rolling (R/L), 10 reps of bridging with holds, and 6 reps of sit<>supine transitions. Tactile cues to trunk musculature and verbal cues for segmental sequencing were required."
  },
  {
    "category": "POSTURE_TRUNK",
    "intervention": "Trunk Control During Transitions",
    "narrative": "Patient engaged in trunk control exercises during transitions to improve [Patient Goal], addressing core weakness. Session included 8 reps of controlled sit<>stand from varied heights and 10 reps of trunk stabilization during reaching. Min verbal cues for neutral spine and tactile cues to facilitate abdominal engagement were provided."
  },
  {
    "category": "POSTURE_TRUNK",
    "intervention": "Trunk Control Sitting/Standing",
    "narrative": "To address poor postural stability, Patient participated in 3 sets of 10 reps of trunk control activities in sitting/standing. Activities included dynamic stabilization exercises and functional reaching with trunk control, requiring verbal cues for segmental control and tactile feedback to facilitate proper activation."
  },
  {
    "category": "WELCOME_TRUNK",
    "intervention": "Trunk Control for Midline Posture",
    "narrative": "Skilled training provided to re-educate postural musculature to maintain midline posture. Patient presented with a lateral lean; tactile and visual cues were provided to facilitate trunk activation and improve upright postural control. Patient able to maintain midline for 1 min vs. 30 sec at baseline."
  },
  {
    "category": "PROPRIOCEPTION_SENSORY_UE",
    "intervention": "R UE Proprioception Training",
    "narrative": "To improve [Patient Goal] 2/2 sensory deficits post-CVA, Patient completed R UE proprioception exercises. Session included 10 reps of joint position matching (eyes closed) and 8 reps of weight-bearing activities on varied surfaces. Tactile feedback for accuracy and verbal cues for spatial awareness were provided."
  },
  {
    "category": "PROPRIOCEPTION_SENSORY_UE",
    "intervention": "L UE Proprioceptive Training",
    "narrative": "Patient engaged in 3 sets of 10 reps of L UE proprioceptive training to improve [Patient Goal] due to peripheral neuropathy. Activities included joint repositioning tasks, graded weight-bearing, and functional reaching with visual occlusion. Mod verbal cues for compensatory strategies and tactile cues (where sensation present) were provided."
  },
  {
    "category": "PROPRIOCEPTION_SENSORY_UE",
    "intervention": "BUE Proprioception Training",
    "narrative": "Patient participated in BUE proprioception training to improve [Patient Goal], addressing impaired body awareness. Activities included 12 reps of symmetrical/asymmetrical movement patterns (eyes closed) and 8 reps of weight shifts in quadruped. Verbal feedback for position accuracy and tactile cues for movement quality were required."
  },
  {
    "category": "PROPRIOCEPTION_SENSORY_UE",
    "intervention": "R Hand Sensory Retraining",
    "narrative": "Sensory retraining for the R hand provided to improve [Patient Goal] given median nerve injury. Activities included 10 trials of texture discrimination (rough/smooth), temperature awareness training, and two-point discrimination drills. Graded sensory input was provided with eyes closed, along with verbal feedback for accuracy."
  },
  {
    "category": "PROPRIOCEPTION_SENSORY_UE",
    "intervention": "L Hand Sensory Retraining",
    "narrative": "Patient completed L hand sensory retraining to improve [Patient Goal] 2/2 peripheral neuropathy. Session included 12 trials of monofilament training and graded texture identification, plus functional object identification (eyes closed). Mod verbal cues for compensatory strategies and safety education for thermal/sharp awareness were provided."
  },
  {
    "category": "PROPRIOCEPTION_SENSORY_LE",
    "intervention": "BLE Proprioception Training",
    "narrative": "Patient completed skilled training for BLE proprioception to improve [Patient Goal] 2/2 diabetic neuropathy. Activities included weight-bearing on foam, 10 reps of joint repositioning (standing), and 20 sec holds of single leg stance (eyes closed). Verbal cues for visual compensation and tactile cues at ankles for awareness were required."
  },
  {
    "category": "PROPRIOCEPTION_SENSORY_LE",
    "intervention": "B Ankle Proprioception Training",
    "narrative": "Patient completed B ankle proprioception exercises to improve [Patient Goal] 2/2 chronic ankle instability. Activities included 10 reps of position matching, standing on unstable surfaces, and 30 sec holds of single leg balance progressions. Min verbal cues for feedback were provided, with SBA for safety."
  },
  {
    "category": "PROPRIOCEPTION_SENSORY_LE",
    "intervention": "BLE Proprioception for Stairs",
    "narrative": "Patient engaged in BLE proprioception training to improve [Patient Goal] 2/2 peripheral neuropathy. Session included 8 reps of step height awareness training, foot placement activities with visual occlusion, and weight shift training on steps. Mod verbal cues for compensation strategies and tactile feedback for positioning were provided."
  },
  {
    "category": "PROPRIOCEPTION_SENSORY_LE",
    "intervention": "Bilateral Foot Sensory Retraining",
    "narrative": "Bilateral foot sensory retraining provided to improve [Patient Goal] due to diabetic neuropathy. Session included 10 trials of weight-bearing sensory awareness on varied textures and pressure discrimination training. Verbal feedback for accuracy and education on daily foot inspection/protective footwear were provided."
  },
  {
    "category": "COORDINATION_MOTOR_PLANNING",
    "intervention": "Bilateral UE Coordination Training",
    "narrative": "Skilled interventions focused on bilateral UE coordination to improve [Patient Goal], targeting cerebellar dysfunction. Session included 3 sets of 12 reps of reciprocal movements, timing drills, and bilateral manipulation activities. Demonstrations for proper patterns and verbal cues to re-educate timing/rhythm were provided."
  },
  {
    "category": "COORDINATION_MOTOR_PLANNING",
    "intervention": "Hand Coordination Training",
    "narrative": "Patient completed 2 sets of 15 reps of hand coordination exercises (finger-to-nose, finger-to-thumb opposition) to improve [Patient Goal] and address ataxia. Skilled intervention required tactile cues for movement initiation and verbal cues to control for accuracy and speed."
  },
  {
    "category": "COORDINATION_MOTOR_PLANNING",
    "intervention": "Whole Body Coordination Training",
    "narrative": "Patient participated in 3 sets of 10 reps of whole body coordination activities to improve [Patient Goal] 2/2 movement disorder. Activities included reciprocal stepping patterns, arm swing coordination, and gait timing drills. Verbal cues for sequencing and tactile cues for movement transitions were provided."
  },
  {
    "category": "COORDINATION_MOTOR_PLANNING",
    "intervention": "Motor Planning - Dressing Sequence",
    "narrative": "Motor planning training provided to improve [Patient Goal], given apraxia post-CVA. Session included 6 trials of multi-step dressing sequences with demonstration, using hand-over-hand fading to tactile prompts. Mod verbal cues for task sequencing and visual cues for proper movements were required."
  },
  {
    "category": "COORDINATION_MOTOR_PLANNING",
    "intervention": "Motor Planning - ADL Sequencing",
    "narrative": "Patient completed motor planning exercises to improve [Patient Goal] 2/2 ideomotor apraxia. Session included 8 trials of functional movement sequences (grooming, feeding) with modeling. Hand-over-hand guidance fading to verbal cues and tactile prompts for movement initiation were used."
  },
  {
    "category": "COORDINATION_MOTOR_PLANNING",
    "intervention": "Motor Planning - Tool Use Training",
    "narrative": "Patient engaged in motor planning activities to improve [Patient Goal] due to apraxia. Session included 10 trials of object use training with demonstration/imitation, using a graded cueing hierarchy. Mod verbal cues with visual modeling and tactile guidance as needed were provided."
  },
  {
    "category": "COORDINATION_MOTOR_PLANNING",
    "intervention": "Weight Shift Training Sitting/Standing",
    "narrative": "Patient participated in controlled weight shift training to improve [Patient Goal] 2/2 stroke with hemiparesis. Activities included 10 reps of lateral/A-P weight shifts in sitting and 8 reps of sit-to-stand with weight shift sequencing. Tactile cues at hips for direction and verbal cues for timing/control were required."
  },
  {
    "category": "COORDINATION_MOTOR_PLANNING",
    "intervention": "Weight Shift Training During Gait",
    "narrative": "Patient completed weight shift control exercises to improve [Patient Goal] given impaired balance. Activities included 12 reps of standing weight shifts with stepping and 3 trials of lateral weight transfer during gait (10 ft). Min verbal cues for proper sequencing and tactile cues for loading/unloading were provided."
  },
  {
    "category": "COORDINATION_MOTOR_PLANNING",
    "intervention": "Weight Shift Awareness Training",
    "narrative": "Patient engaged in weight shift awareness training to improve [Patient Goal], addressing asymmetric loading. Session included weight distribution training with visual feedback and 10 reps (each direction) of controlled shifts to limits. Verbal cues for equal distribution and tactile feedback at hips for awareness were provided."
  },
  {
    "category": "COORDINATION_MOTOR_PLANNING",
    "intervention": "Functional Movement Pattern Training - PNF",
    "narrative": "Patient completed 3 sets of 10 reps of functional movement pattern training to improve [Patient Goal], addressing compensatory patterns post-CVA. Activities included PNF diagonal patterns (UE/LE) and 12 reps of functional reaching with proper sequencing. Tactile facilitation for muscle activation and verbal cues for coordinated movement were required."
  },
  {
    "category": "COORDINATION_MOTOR_PLANNING",
    "intervention": "Movement Pattern Optimization (Parkinson's)",
    "narrative": "To address bradykinesia 2/2 Parkinson's disease, Patient engaged in 3 sets of 10 reps of optimal movement pattern training. Activities included large amplitude movements, reciprocal patterns, and dual-task training to improve [Patient Goal]. Verbal cues for movement size/speed and tactile cues for proper muscle recruitment were provided."
  },
  {
    "category": "COORDINATION_MOTOR_PLANNING",
    "intervention": "Functional Movement Pattern Retraining",
    "narrative": "Patient participated in 3 sets of 10 reps of movement pattern optimization to improve [Patient Goal], addressing abnormal movement patterns. Activities included task-specific training with proper biomechanics and diagonal movement patterns. Min verbal cues for efficient patterns and tactile feedback for muscle activation were required."
  },
  {
    "category": "VESTIBULAR",
    "intervention": "Vestibular Training - Gaze Stabilization",
    "narrative": "Skilled interventions focused on vestibular deficits to improve [Patient Goal] due to BPPV. Session included 10 reps of gaze stabilization exercises (VOR x1 viewing) and 3 trials of head turns during walking (20 ft). Verbal cues for controlled movements and SBA for safety during position changes were required."
  },
  {
    "category": "VESTIBULAR",
    "intervention": "Vestibular Rehabilitation Training",
    "narrative": "Patient completed a vestibular rehabilitation program to improve [Patient Goal] 2/2 vestibular hypofunction. Activities included 3 sets of 10 reps of VOR exercises, 8 reps of standing balance with head movements, and 3 trials of gait with head turns (15 ft). Min verbal cues for progression and SBA for positional changes were provided."
  },
  {
    "category": "VESTIBULAR",
    "intervention": "Vestibular Habituation Training",
    "narrative": "Patient participated in vestibular adaptation training to improve [Patient Goal] 2/2 positional vertigo. Session included 5 reps each of habituation exercises for provocative positions and 10 reps of gaze stabilization during movement. Verbal cues for controlled movements and education on home program compliance were provided."
  },
  {
    "category": "NEURO_RESPONSE_COMPLEX",
    "intervention": "Management of Visual Neglect",
    "narrative": "Patient participated in [Activity, e.g., grooming] to improve [Patient Goal]. Performance was impacted by significant L neglect, with Patient avoiding use of LUE. Skilled intervention focused on tactile/verbal cues to L side and environmental setup (placing items to L) to force scanning. Patient able to attend to L visual field for 3/10 trials."
  },
  {
    "category": "NEURO_RESPONSE_COMPLEX",
    "intervention": "Management of Tremor",
    "narrative": "Patient participated in [Activity, e.g., self-feeding] to improve [Patient Goal]. Mild intention tremors impacted task completion. Skilled intervention focused on providing proximal stabilization at the [Joint, e.g., elbow] and verbal cues for pacing. Patient completed 5/5 trials with mod physical assist to manage tremor."
  },
  {
    "category": "NEURO_RESPONSE_COMPLEX",
    "intervention": "Management of Cognitive Deficits",
    "narrative": "Patient completed [Activity, e.g., card game] to improve [Patient Goal]. After 2/5 trials, Patient began perseverating on [Topic, e.g., wanting to go home] and was unable to be redirected. Session modified to address patient concerns; will attempt activity again next session."
  },
  {
    "category": "VISUAL_MOTOR_INTEGRATION",
    "intervention": "VMI Maintained with Compensatory Strategies",
    "narrative": "Patient demonstrated maintained visual-motor integration skills during functional writing and meal prep tasks. Required reading glasses and increased lighting setup for optimal performance. Patient able to complete 15 min of bill paying with min visual cues for line tracking. Visual-motor coordination adequate for IADL tasks with environmental modifications in place."
  },
  {
    "category": "VISUAL_MOTOR_INTEGRATION",
    "intervention": "Hand-Eye Coordination Sustained with Adaptive Equipment",
    "narrative": "Patient facilitated in fine motor tasks requiring sustained visual-motor control. Hand-eye coordination maintained at baseline level for grooming and light meal prep given consistent use of adaptive equipment. Patient able to thread buttons and manage utensils with built-up handles. CGA for safety during reaching tasks outside visual field."
  },
  {
    "category": "VISUAL_MOTOR_INTEGRATION",
    "intervention": "VMI Decline Due to Progressive Condition",
    "narrative": "Patient exhibited declining visual-motor integration during ADL tasks 2/2 progressive neurological condition. Mod physical assist required for tasks involving hand-eye coordination including grooming and dressing. Patient demonstrated difficulty with spatial awareness when reaching for items, missing targets 40% of attempts. Graded cues and hand-over-hand guidance required for safe task completion."
  },
  {
    "category": "VISUAL_MOTOR_INTEGRATION",
    "intervention": "Visual-Motor Skills Declining with Increased Errors",
    "narrative": "Patient facilitated in functional tasks demonstrating decreased visual-motor performance compared to baseline. Patient required max verbal cues for accurate hand placement during self-feeding, with spillage noted on 6 of 10 attempts due to impaired depth perception. Visual tracking difficulties observed during grooming tasks requiring mirror use. SBA upgraded to mod assist for safety."
  },
  {
    "category": "COGNITIVE_PERCEPTUAL",
    "intervention": "Cognition Maintained with Memory Aids",
    "narrative": "Patient demonstrated maintained cognitive-perceptual skills with compensatory strategies in place. Patient able to sequence basic ADLs with use of written checklist and min verbal cues for task initiation. Memory aids including calendar and medication organizer setup required for optimal performance. Patient correctly identified 4 of 4 safety concerns during simulated kitchen task."
  },
  {
    "category": "COGNITIVE_PERCEPTUAL",
    "intervention": "Problem-Solving Sustained with Cueing Hierarchy",
    "narrative": "Patient facilitated in IADL tasks requiring cognitive processing and problem-solving. Patient maintained baseline cognitive function during meal prep and light housekeeping with established cueing hierarchy. Required min verbal cues for sequencing multi-step tasks. Patient able to make appropriate decisions regarding safety and task modifications with SBA."
  }
]