[
  {
    "category": "FUNCTIONAL_MOBILITY",
    "intervention": "Lifting/carrying to increase functional skills",
    "narrative": "Therapeutic activity training using simulated grocery shopping task with lifting/carrying to improve [Patient Goal]. Graded weight-bearing activities with functional objects (2-5 lbs), pushing weighted cart 20 ft and reaching for items on shelves at varying heights. Activity integrated multiple parameters including UE strength, dynamic balance, and endurance for functional carryover. Min verbal cues for proper body mechanics to prevent injury. Patient tolerated 5 lb items x 10 reps vs 3 reps at baseline, demonstrating improved functional lifting capacity."
  },
  {
    "category": "FUNCTIONAL_MOBILITY",
    "intervention": "Bending/lifting/carrying tasks",
    "narrative": "Patient engaged in simulated laundry task integrating bending, lifting, and carrying to improve functional skill performance for [Patient Goal]. Dynamic activity involved carrying 5 lb basket for 15 ft, bending to floor level to retrieve items, and returning to standing using proper body mechanics. SBA for safety with mod verbal cues for pacing and breathing techniques. Patient completed 8/10 trials with improved technique and control vs 5/10 at baseline. No loss of balance events occurred."
  },
  {
    "category": "FUNCTIONAL_MOBILITY",
    "intervention": "Dynamic functional activities",
    "narrative": "Patient practiced door management with dynamic functional training to improve community mobility and [Patient Goal]. Activity required opening/closing weighted door while maneuvering RW for access, integrating multi-planar movements, balance control, and UE strength. CGA with min tactile cues at hips to facilitate proper weight shifting and sequencing. Patient demonstrated improved door management with proper timing and control vs requiring hand-held assist at baseline."
  },
  {
    "category": "FUNCTIONAL_MOBILITY",
    "intervention": "Placement of objects out of reach",
    "narrative": "Skilled therapeutic activity training with overhead and lateral reaching to improve functional ROM for [Patient Goal]. Patient performed UB dressing at EOB with objects placed out of reach to challenge dynamic balance and shoulder mobility. Activity integrated balance, coordination, and ROM in functional context. Min verbal cues to thread arms through sleeves with improved sequencing. Patient demonstrated increased shoulder flexion to 130° actively during functional task vs 110° at baseline."
  },
  {
    "category": "FUNCTIONAL_MOBILITY",
    "intervention": "Standing tolerance activities",
    "narrative": "Patient engaged in dynamic standing activities at counter with reaching to improve standing tolerance for [Patient Goal]. Functional task of folding towels while standing with RW support x 8 minutes, integrating endurance, balance, and UE coordination. Min verbal cues for proper weight distribution and upright posture maintenance. Patient tolerated standing 8 min vs 4 min at baseline with improved endurance and decreased fatigue. No loss of balance events occurred."
  },
  {
    "category": "FUNCTIONAL_MOBILITY",
    "intervention": "Floor-level reaching",
    "narrative": "Floor-level reaching activity completed while seated to promote trunk flexion and hip mobility for functional LB dressing tasks. Therapeutic activity used visual cues of observable goal to challenge ROM, balance, and motor control in functional context. 8/10 trials completed with min verbal cues for increased trunk flexion and proper body mechanics when reaching toward BLE. Patient demonstrated improved forward reach distance of 12 inches vs 8 inches at baseline."
  },
  {
    "category": "BED_MOBILITY",
    "intervention": "Bed mobility training",
    "narrative": "Patient performed bridging activities as part of functional bed mobility training to improve position adjustment for LB dressing and pressure relief. 8 reps of bridging technique emphasizing sustained holds for functional clothing management in supine. Mod tactile cues to gluteals for activation and min verbal cues for controlled lowering to prevent pain. Patient able to hold bridge 5 sec vs 2 sec at baseline, sufficient for advancing pants during functional dressing. Activity directly prepares for independent LB dressing in bed."
  },
  {
    "category": "BED_MOBILITY",
    "intervention": "Bed mobility training - rolling",
    "narrative": "Patient practiced rolling with functional bed mobility training using segmental rotation for pressure relief and position changes. Supine<>sidelying bilaterally for functional positioning during dressing and hygiene tasks using proper body mechanics. Max verbal cues for head/neck placement and use of BUE to initiate and control momentum. Patient completed 4/5 trials with improved fluidity and control vs 2/5 at baseline, demonstrating progress toward independent bed mobility for ADL performance."
  },
  {
    "category": "BED_MOBILITY",
    "intervention": "Bed mobility training - scooting",
    "narrative": "Patient completed scooting activities in bed with functional mobility training using UE and LE strength to reposition for ADL tasks. Activity performed x4 up/down in bed to improve independence with positioning for dressing and hygiene. Mod assist for leg management with min verbal cues to coordinate pushing/pulling movements. Patient advanced 8 inches independently vs 4 inches with max assist at baseline. Skilled instruction provided in optimal techniques for energy conservation."
  },
  {
    "category": "BED_MOBILITY",
    "intervention": "Bed mobility training - transitions",
    "narrative": "Skilled therapeutic training for supine to sit at EOB transition to improve functional bed mobility for [Patient Goal]. Emphasis on core engagement and controlled movement with proper body mechanics to prepare for edge-of-bed dressing tasks. CGA with mod tactile cues to trunk to prevent loss of balance during transitional movements. Patient completed transition in 12 sec vs 20 sec at baseline with improved control and decreased assist level."
  },
  {
    "category": "BED_MOBILITY",
    "intervention": "Bed mobility - lateral movement",
    "narrative": "Patient completed lateral scooting in bed with functional mobility training to improve independence with bed positioning for hygiene and dressing tasks. Sidelying to supine with controlled movement x6 reps to challenge strength, coordination, and motor control. Tactile cues to initiate with BUE and verbal cues for segmental movement patterns. Patient completed 5/6 reps independently vs 2/6 at baseline, demonstrating improved functional mobility."
  },
  {
    "category": "TRANSFERS",
    "intervention": "Closed kinetic chain activity",
    "narrative": "Patient performed sit-to-stand transfers as dynamic functional activity to improve transfer independence for [Patient Goal]. 5 STS repetitions from standard height chair using RW, integrating LE strengthening, balance, and coordination in functional context. Min verbal cues for forward weight shift and tactile cues at knees for extension. Patient completed transfers with 30% less assist vs baseline (mod assist → min assist), demonstrating functional improvement in ADL-related transfers."
  },
  {
    "category": "TRANSFERS",
    "intervention": "Dynamic functional activities",
    "narrative": "Patient completed w/c to/from bed transfer with dynamic functional training emphasizing safety and independence. Transfer sequence training integrated proper body mechanics, equipment management, and multi-step sequencing. SBA with min verbal cues for proper sequencing including w/c positioning, brake engagement, footrest removal, and controlled pivoting. Patient demonstrated 5/5 safety checks independently vs requiring 3 verbal cues at baseline, showing improved safety awareness and carryover."
  },
  {
    "category": "TRANSFERS",
    "intervention": "Closed kinetic chain - transfer training",
    "narrative": "Skilled therapeutic training in toilet transfers integrating UE weight-bearing, LE strengthening, and balance control for functional independence. Proper weight-bearing through UE using grab bars with controlled sit<>stand movements. CGA with mod verbal cues to push up from support surface and control eccentric descent. Patient tolerated 6 reps vs 3 reps at baseline with improved endurance for repeated transfers. No loss of balance events; fall risk precautions maintained."
  },
  {
    "category": "TRANSFERS",
    "intervention": "Dynamic functional activities - transfers",
    "narrative": "Patient practiced tub transfer as dynamic functional activity integrating strength, ROM, flexibility, and balance in progressive manner for [Patient Goal]. Activity performed using tub bench with emphasis on proper body mechanics and safety. SBA with min verbal cues for leg management over tub wall and controlled lowering. Patient demonstrated improved control and confidence with 4/4 transfers completed safely vs 2/4 at baseline. Patient verbalized understanding of safety techniques when queried."
  },
  {
    "category": "TRANSFERS",
    "intervention": "Stand pivot transfers",
    "narrative": "Patient performed stand pivot transfers as dynamic functional activity from w/c to mat table to improve functional mobility. Transfer sequence integrated proper RW positioning, weight shifting, pivoting, and controlled lowering. Mod verbal cues for optimal foot positioning and tactile cues at hips to facilitate weight transfer. Patient completed 4/5 transfers with SBA vs requiring mod assist at baseline. Fall risk precautions maintained throughout."
  },
  {
    "category": "TRANSFERS",
    "intervention": "Modified transfer training",
    "narrative": "Patient completed modified squat pivot transfer from w/c to plinth as functional strengthening activity. Dynamic activity emphasized controlled eccentric lowering integrating LE strength, balance, and coordination with proper body mechanics. Mod assist for initial positioning with min verbal cues for safety during descent. Patient demonstrated improved technique and confidence vs requiring max assist at baseline. Skilled clinical judgment applied to grade activity difficulty based on patient's fluctuating pain and balance."
  },
  {
    "category": "DYNAMIC_BALANCE",
    "intervention": "Throwing/catching activities",
    "narrative": "Patient performed 6 trials of standing ring toss as dynamic functional activity to improve balance and UE ROM for [Patient Goal]. Activity used 5 large lightweight rings to facilitate bilateral shoulder ROM for enhanced dressing performance while challenging standing balance. RW with SBA for stability; min verbal cues for timed release and proper sequencing. Patient achieved 5/6 successful tosses with improved control vs 2/6 at baseline. Activity integrates multiple parameters including dynamic balance, coordination, and shoulder mobility."
  },
  {
    "category": "DYNAMIC_BALANCE",
    "intervention": "Bilateral integration",
    "narrative": "Patient performed seated balloon toss as therapeutic activity integrating bilateral UE coordination and dynamic trunk control x 15 reps. Activity required coordinated bilateral hand use to challenge trunk rotation, midline crossing, and sitting balance for functional carryover to ADLs. Min verbal cues to cross midline and maintain upright posture. Patient demonstrated improved midline crossing and bilateral coordination with 12/15 successful catches vs 7/15 at baseline."
  },
  {
    "category": "DYNAMIC_BALANCE",
    "intervention": "Dynamic balance sitting - crossing midline",
    "narrative": "Skilled therapeutic interventions focused on dynamic sitting balance with midline crossing activities to improve functional independence with [Patient Goal]. Tasks graded with placement of objects out of reach to promote dynamic weight shifting, postural control, and functional reaching patterns. Demonstrations and min verbal cues for safety awareness and proper technique. Patient completed 8/10 reaches across midline vs 5/10 at baseline, demonstrating improved dynamic balance control."
  },
  {
    "category": "DYNAMIC_BALANCE",
    "intervention": "Dynamic balance standing",
    "narrative": "Patient completed standing cone taps as dynamic balance activity while standing x 10 reps bilateral LE. Functional activity challenged single-leg stance, weight transfer, and coordination to improve mobility for ADLs. SBA with RW for support and min verbal cues for pacing and proper mechanics. Patient maintained balance 9/10 trials with improved weight transfer vs 6/10 at baseline. No loss of balance events; fall risk precautions maintained."
  },
  {
    "category": "DYNAMIC_BALANCE",
    "intervention": "Weight shifting activities",
    "narrative": "Patient performed anterior-posterior weight shift activities as dynamic therapeutic training while standing to improve balance control. A-P weight shifts x10 reps with RW using controlled movement to challenge limits of stability. Tactile cues at hips for proprioceptive awareness and verbal cues for proper sequencing. Patient maintained balance 8/10 trials vs 5/10 at baseline, demonstrating improved postural control for functional tasks."
  },
  {
    "category": "DYNAMIC_BALANCE",
    "intervention": "Reaching beyond base of support",
    "narrative": "Patient engaged in seated reaching beyond BOS as dynamic balance activity x12 reps to improve postural control for [Patient Goal]. Multi-directional reaching for functional objects (cups, utensils, grooming items) to challenge sitting balance and trunk control in functional context. Min verbal cues for controlled weight shift and safe return to center. Patient completed all reaches without loss of balance vs 7/12 requiring stabilization at baseline."
  },
  {
    "category": "UPPER_EXTREMITY",
    "intervention": "Overhead activities to increase ROM",
    "narrative": "Patient engaged in overhead reaching activity using simulated wall washing to improve shoulder mobility for ADL performance and [Patient Goal]. Therapeutic activity promoted sustained overhead positioning for 5 min to challenge endurance and ROM in functional context. Min verbal cues for proper scapular stabilization and trunk control. Patient achieved 145° shoulder flexion actively during functional task vs 120° at baseline, demonstrating functional ROM improvement."
  },
  {
    "category": "UPPER_EXTREMITY",
    "intervention": "Bilateral integration training",
    "narrative": "Patient performed bilateral assembly tasks as therapeutic activity requiring coordinated bilateral hand use for [Patient Goal]. Stabilize-and-manipulate tasks using nuts/bolts/fasteners to improve bilateral coordination for functional ADL tasks. Min verbal cues for timing and synchronous movements. Patient completed 8/10 assemblies with both hands efficiently vs 5/10 at baseline, showing improved bilateral coordination and functional dexterity."
  },
  {
    "category": "UPPER_EXTREMITY",
    "intervention": "Fine motor coordination",
    "narrative": "Patient completed pegboard activities as fine motor therapeutic training using graded sizes of pegs to improve dexterity for ADLs. Activity performed with various sized pegs/openings (small, medium, large) to challenge precision grasp and manipulation skills. Tactile cues for precision and verbal cues for optimal pinch patterns. Patient placed 12 pegs in 60 sec vs 8 pegs at baseline, demonstrating improved speed and dexterity for functional tasks."
  },
  {
    "category": "UPPER_EXTREMITY",
    "intervention": "Theraputty techniques to increase grip",
    "narrative": "Patient practiced theraputty manipulation techniques as functional strengthening activity to improve grip strength for ADL tasks. Pinching theraputty with various finger combinations, rolling into balls, and sustained holds to challenge grasp patterns. Graded resistance progression from soft (yellow) to medium (red) theraputty. Patient tolerated medium resistance x 10 reps vs soft resistance only at baseline, demonstrating improved functional grip strength."
  },
  {
    "category": "UPPER_EXTREMITY",
    "intervention": "Sustained grasp activities",
    "narrative": "Patient completed sustained grasp activities with weighted objects to improve endurance for functional holding tasks. Carrying 3 lb weighted can x 20 feet and sustained static hold x45 sec to challenge grip endurance for meal prep and ADLs. Min verbal cues for proper grasp pattern and wrist positioning. Patient sustained grasp 45 sec vs 20 sec at baseline, demonstrating improved functional endurance."
  },
  {
    "category": "BALANCE_COORDINATION",
    "intervention": "Bending to increase dynamic balance",
    "narrative": "Patient performed floor-level object retrieval as dynamic functional activity to improve balance skills for [Patient Goal]. Forward bending with controlled return to standing using proper body mechanics to simulate functional floor transfers and item retrieval. Dynamic weight shifting during bending required for safe execution. Patient completed 8/10 bends with improved postural control and recovery vs 5/10 at baseline. Fall risk precautions maintained; no loss of balance occurred."
  },
  {
    "category": "BALANCE_COORDINATION",
    "intervention": "Dual-task activities",
    "narrative": "Patient engaged in dual-task therapeutic training integrating balance and cognitive demands to improve functional performance. Standing balance while sorting objects by color/size using RW for support, challenging divided attention and postural control simultaneously. Mod verbal cues for divided attention strategies and safety monitoring. Patient sorted 15/20 objects correctly while maintaining balance vs 8/20 at baseline, demonstrating improved dual-task performance. Patient continues to require skilled OT for ongoing cognitive-motor integration training."
  },
  {
    "category": "DYNAMIC_BALANCE",
    "intervention": "Marching in place",
    "narrative": "Patient engaged in marching in place as dynamic functional activity to improve strength and endurance for ambulation. Activity performed x 2 min with RW for support, emphasizing proper body mechanics and dynamic single-leg balance. Min verbal cues to increase step height and maintain upright posture throughout activity. Patient achieved 3-inch step height vs 1.5-inch at baseline, demonstrating improved hip flexion strength and balance control."
  },
  {
    "category": "DYNAMIC_BALANCE",
    "intervention": "Obstacle management training",
    "narrative": "Patient practiced stepping over obstacles as dynamic balance therapeutic training to improve safety and mobility for [Patient Goal]. Small objects (2-inch cones) x 10 reps using RW with controlled movement to challenge foot clearance and dynamic balance. SBA with min verbal cues for proper foot clearance, placement, and visual scanning. Patient cleared obstacles 9/10 trials vs 6/10 at baseline, demonstrating improved obstacle negotiation skills. Fall risk precautions maintained throughout."
  },
  {
    "category": "DYNAMIC_BALANCE",
    "intervention": "Static balance training",
    "narrative": "Skilled therapeutic instruction in tandem stance as static balance activity to improve standing tolerance and balance endurance. Activity performed 30 sec x 4 trials to challenge narrow BOS standing for functional tasks. CGA with hands positioned for stabilization as needed. Patient maintained stance 25 sec vs 12 sec at baseline, demonstrating improved static balance endurance. No loss of balance events occurred."
  },
  {
    "category": "DYNAMIC_BALANCE",
    "intervention": "Lateral weight shifting",
    "narrative": "Patient performed medial-lateral weight shift activities as dynamic balance therapeutic training while standing to improve postural control. M-L weight shifts x10 reps each direction with RW using controlled movement to challenge frontal plane stability. Tactile cues at hips for proprioceptive awareness and verbal cues for proper sequencing and control. Patient maintained balance 8/10 trials vs 5/10 at baseline without loss of balance."
  },
  {
    "category": "FINE_MOTOR_COORDINATION",
    "intervention": "Pegboard activities",
    "narrative": "Patient completed pegboard activities as fine motor therapeutic training using graded peg sizes to improve functional dexterity for ADL fasteners and buttons. Activity performed with various sized pegs/openings to challenge precision and manipulation skills. Tactile cues for precision and verbal cues for optimal tripod grasp pattern. Patient placed 12 pegs in 60 sec vs 8 pegs at baseline, demonstrating improved speed and accuracy for functional tasks."
  },
  {
    "category": "FINE_MOTOR_COORDINATION",
    "intervention": "Pinch strengthening",
    "narrative": "Patient engaged in pinch strengthening activities using theraputty to improve functional grasp patterns for ADLs. Lateral pinch, tip pinch, and palmar pinch exercises x10 reps x3 sets using medium resistance to challenge various grasp patterns. Min verbal cues for proper hand/finger positioning. Patient tolerated medium resistance vs soft resistance at baseline, demonstrating improved pinch strength (lateral pinch 6 lbs vs 3 lbs at baseline)."
  },
  {
    "category": "FINE_MOTOR_COORDINATION",
    "intervention": "In-hand manipulation",
    "narrative": "Patient practiced in-hand manipulation tasks with small objects as therapeutic activity to improve fine motor skills for [Patient Goal]. Coin rotation, finger-to-palm translation, and shift activities x15 trials to challenge dexterity for functional tasks. Tactile cues for precision and verbal cues for isolated finger movements. Patient completed 12/15 trials successfully vs 7/15 at baseline, demonstrating improved in-hand manipulation abilities."
  },
  {
    "category": "FINE_MOTOR_COORDINATION",
    "intervention": "Functional object manipulation",
    "narrative": "Patient completed functional object manipulation tasks with buttons, zippers, and snaps as therapeutic activity to improve ADL fastener management. Opening/closing 10 fasteners of varying sizes (small, medium, large) to challenge fine motor dexterity in functional context. Demonstrations and min verbal cues for compensatory techniques. Patient completed 8/10 fasteners independently vs 4/10 at baseline, demonstrating improved functional dexterity."
  },
  {
    "category": "DEXTERITY",
    "intervention": "Bilateral hand coordination",
    "narrative": "Patient performed bilateral hand coordination activities as therapeutic training using stabilize-and-manipulate tasks for [Patient Goal]. Nut and bolt assembly, card shuffling exercises x12 trials to challenge bilateral integration for functional tasks. Min verbal cues for timing, coordination, and sequential movements. Patient completed 10/12 tasks with improved speed and accuracy vs 6/12 at baseline."
  },
  {
    "category": "DEXTERITY",
    "intervention": "Speed and precision tasks",
    "narrative": "Patient engaged in speed and precision therapeutic training with timed peg placement and bead stringing to improve hand dexterity for functional tasks. Activities performed x3 sets of 10 items each to challenge speed while maintaining accuracy. Verbal cues for pacing, proper grasp patterns, and efficiency. Patient placed all items in 45 sec vs 75 sec at baseline, demonstrating improved dexterity and speed for functional performance."
  },
  {
    "category": "DEXTERITY",
    "intervention": "Grasp and release patterns",
    "narrative": "Patient completed grasp and release pattern training with various sized objects as therapeutic activity to improve functional object manipulation. Graded cylindrical, spherical, and lateral pinch patterns x15 reps each to challenge different grasp types. Tactile cues for optimal hand positioning and verbal cues for controlled, smooth release. Patient demonstrated improved control 14/15 trials vs 9/15 at baseline."
  },
  {
    "category": "DEXTERITY",
    "intervention": "Functional reach and grasp",
    "narrative": "Patient practiced functional reach and grasp activities with weighted objects at varying heights to improve ADL performance for [Patient Goal]. Reaching for and manipulating items from shelves while seated x10 reps to simulate meal prep and household tasks. Min verbal cues for trunk stability and proper body mechanics during reaching. Patient completed all reaches with improved control and positioning vs 7/10 requiring stabilization at baseline."
  },
  {
    "category": "UE_ROM",
    "intervention": "Overhead reaching activities",
    "narrative": "Patient engaged in overhead reaching therapeutic activity using simulated wall washing to improve shoulder mobility for functional overhead tasks. Activity promoted sustained overhead positioning for 5 min to challenge ROM and endurance in functional context. Min verbal cues for proper scapular stabilization, trunk control, and breathing techniques. Patient achieved 145° shoulder flexion actively during task vs 120° at baseline, demonstrating functional improvement."
  },
  {
    "category": "UE_ROM",
    "intervention": "Functional reaching patterns",
    "narrative": "Patient completed functional reaching patterns in multiple planes as therapeutic activity to improve UE ROM for [Patient Goal]. Diagonal reaching, cross-body reaching, and behind-back reaching x10 reps each direction to challenge ROM in functional movement patterns. Tactile cues for scapular mobility and verbal cues for proper mechanics and breathing. Patient demonstrated increased reach distance in all planes, achieving functional ROM for dressing and grooming tasks."
  },
  {
    "category": "UE_ROM",
    "intervention": "Weight-bearing activities",
    "narrative": "Patient performed UE weight-bearing activities on elevated surface as therapeutic training to improve shoulder/elbow ROM and stability. Quadruped position on mat table, plank holds x30 sec x4 reps to challenge joint ROM and muscular endurance. Mod verbal cues for proper alignment and tactile cues for elbow extension. Patient tolerated 30 sec holds vs 15 sec at baseline, demonstrating improved UE weight-bearing tolerance."
  },
  {
    "category": "UE_ROM",
    "intervention": "Bilateral UE elevation",
    "narrative": "Patient engaged in bilateral UE elevation activities with resistance band as therapeutic training to improve shoulder ROM for [Patient Goal]. Overhead pulls, lateral raises x10 reps x3 sets using yellow (light) resistance band to challenge ROM and strength simultaneously. Min verbal cues for synchronous bilateral movement and proper breathing techniques. Patient achieved full overhead elevation bilaterally vs 130° at baseline."
  },
  {
    "category": "UE_ROM",
    "intervention": "Sustained stretch positioning",
    "narrative": "Patient completed sustained stretch positioning for shoulder/elbow ROM as therapeutic activity to improve flexibility for functional reaching. Corner stretch for pectorals, overhead tricep stretch x45 sec hold x3 reps each position. Skilled instruction in proper positioning, breathing techniques, and gradual progression. Patient tolerated full stretch positions with min discomfort (2/10 pain vs 4/10 at baseline), demonstrating improved tolerance and flexibility."
  },
  {
    "category": "FUNCTIONAL_MOBILITY",
    "intervention": "Simulated Grocery Shopping",
    "narrative": "Patient performed simulated grocery shopping as functional therapeutic activity, pushing a weighted cart and reaching for items on shelves to challenge BUE strength, dynamic balance, and activity tolerance for [Patient Goal]. Cart weight progressed from 5 lbs to 10 lbs based on patient tolerance. Min verbal cues for proper body mechanics and energy conservation. Activity integrates multiple functional parameters for community mobility preparation."
  },
  {
    "category": "FUNCTIONAL_MOBILITY",
    "intervention": "Simulated Laundry Task",
    "narrative": "Patient engaged in simulated laundry task as functional therapeutic activity, involving carrying a basket (5 lbs) for 15 ft and bending to retrieve items to improve functional capacity for [Patient Goal]. Activity integrated bending, lifting, carrying, and balance in realistic ADL context. SBA for safety with mod verbal cues for pacing and proper body mechanics. Patient demonstrated improved endurance and technique."
  },
  {
    "category": "FUNCTIONAL_MOBILITY",
    "intervention": "Weighted Door with RW",
    "narrative": "Patient practiced opening/closing weighted door as functional therapeutic activity while maneuvering RW for access to improve community mobility skills. Activity challenged multi-planar movements, UE strength, and dynamic balance control. CGA with min tactile cues at hips to facilitate proper weight shifting and sequencing. Patient demonstrated improved door management and timing for safe community access."
  },
  {
    "category": "FUNCTIONAL_MOBILITY",
    "intervention": "UB Dressing Training at EOB",
    "narrative": "Skilled therapeutic instruction in UB dressing at EOB as functional activity, focusing on task sequencing and energy conservation techniques for [Patient Goal]. Activity integrated sitting balance, UE coordination, and cognitive sequencing in functional context. Min verbal cues to thread arms through sleeves and manage clothing fasteners. Patient demonstrated improved independence and decreased time to complete task."
  },
  {
    "category": "FUNCTIONAL_MOBILITY",
    "intervention": "Standing Ring Toss",
    "narrative": "Patient performed 6 trials of standing ring toss using 5 large lightweight rings as therapeutic activity to improve bilateral shoulder ROM for dressing and dynamic standing balance. Activity challenged UE elevation, coordination, and postural control simultaneously. RW with SBA for stability; min verbal cues for timed release and proper mechanics. Activity prepares patient for functional overhead reaching in ADLs."
  },
  {
    "category": "FUNCTIONAL_MOBILITY",
    "intervention": "Seated Balloon Toss",
    "narrative": "Patient performed seated balloon toss x 15 reps as therapeutic activity to challenge trunk rotation, bilateral UE coordination, and sitting balance for [Patient Goal]. Activity required dynamic trunk movements and midline crossing for functional carryover. Min verbal cues to cross midline and maintain upright posture throughout activity. Patient demonstrated improved dynamic sitting balance and bilateral coordination."
  },
  {
    "category": "FUNCTIONAL_MOBILITY",
    "intervention": "Dynamic Balance Sitting",
    "narrative": "Skilled therapeutic interventions focused on dynamic sitting balance while crossing midline to improve functional independence with [Patient Goal]. Tasks graded with objects placed out of reach to challenge postural control, weight shifting, and trunk rotation. Demonstrations and min verbal cues for safety and proper technique. Activity simulates functional reaching during ADL tasks."
  },
  {
    "category": "BED_MOBILITY",
    "intervention": "Bridging for Strengthening",
    "narrative": "Patient performed 8 reps of bridging in supine as part of functional bed mobility training to improve position adjustment for LB dressing. Activity emphasized sustained holds to allow for functional clothing management in supine position. Mod tactile cues to gluteals for activation and min verbal cues for controlled lowering to prevent pain. Functional activity directly prepares for independent supine dressing."
  },
  {
    "category": "BED_MOBILITY",
    "intervention": "Rolling for Pressure Relief",
    "narrative": "Patient practiced rolling supine<>sidelying bilaterally as functional bed mobility training for pressure relief and position changes during hygiene/dressing. Activity emphasized segmental control and proper sequencing. Max verbal cues for head/neck placement and use of BUE to initiate and control momentum. Patient demonstrated improved fluidity for functional position changes in bed."
  },
  {
    "category": "BED_MOBILITY",
    "intervention": "Scooting in Bed",
    "narrative": "Patient completed scooting up/down in bed x4 as functional therapeutic activity using BUE/BLE to improve independence with bed positioning for dressing and hygiene. Mod assist for leg management with min verbal cues to coordinate pushing/pulling movements. Activity prepares patient for independent repositioning during functional ADL tasks in bed."
  },
  {
    "category": "BED_MOBILITY",
    "intervention": "Supine to Sit Training",
    "narrative": "Skilled therapeutic training for supine to sit at EOB as functional bed mobility activity to improve transitions for edge-of-bed dressing. Activity emphasized core engagement and controlled movement to prepare for safe seated ADL tasks. CGA with mod tactile cues to trunk to prevent loss of balance during transitional movement. Patient demonstrated improved speed and control for functional transitions."
  },
  {
    "category": "TRANSFERS",
    "intervention": "STS Transfers with RW",
    "narrative": "Patient performed 5 sit-to-stand transfers from standard height chair using RW as functional therapeutic activity to improve transfer independence. Activity integrated LE strengthening, balance, and coordination in functional transfer context. Min verbal cues for forward weight shift and tactile cues at knees for proper extension. Patient demonstrated improved transfer technique and decreased assistance."
  },
  {
    "category": "TRANSFERS",
    "intervention": "W/C to Bed Transfer",
    "narrative": "Patient completed w/c to/from bed transfer as functional therapeutic activity with emphasis on safety and proper sequencing. Activity integrated equipment management, balance, and multi-step coordination. SBA with min verbal cues for proper sequencing including w/c positioning, brake engagement, and leg rest removal. Patient demonstrated improved safety awareness and transfer technique."
  },
  {
    "category": "TRANSFERS",
    "intervention": "Toilet Transfer Training",
    "narrative": "Skilled therapeutic training in toilet transfers as functional activity integrating grab bar use, weight-bearing, and balance control. Activity emphasized controlled sit<>stand movements with proper mechanics. CGA with mod verbal cues to push up from support surface and control eccentric descent onto toilet. Patient demonstrated improved transfer control and safety."
  },
  {
    "category": "TRANSFERS",
    "intervention": "Tub Transfer Practice",
    "narrative": "Patient practiced tub transfer using tub bench as functional therapeutic activity to improve bathing independence for [Patient Goal]. Activity integrated dynamic balance, leg management, and safety awareness. SBA with min verbal cues for proper leg positioning over tub wall and body mechanics to prevent injury. Patient demonstrated improved confidence and control with tub transfers."
  },
  {
    "category": "FUNCTIONAL_MOBILITY_BALANCE",
    "intervention": "Balance Maintained with DME Support",
    "narrative": "Patient demonstrated maintained balance and functional mobility with consistent use of RW and adaptive strategies. Patient able to ambulate 50 ft with RW and SBA for safety monitoring. Static standing balance adequate for short grooming tasks at sink with one hand on walker for support. Dynamic balance maintained during ADL tasks with CGA for safety during reaching outside BOS. Patient continues to require skilled OT for equipment assessment and functional mobility maintenance."
  },
  {
    "category": "FUNCTIONAL_MOBILITY_BALANCE",
    "intervention": "Mobility Sustained with Assistive Device",
    "narrative": "Patient facilitated in functional mobility tasks demonstrating maintained balance and mobility with adaptive equipment and compensatory strategies. Patient able to complete w/c propulsion independently for distances up to 100 ft. Transfers maintained at baseline level requiring min assist with grab bars for w/c<>bed/toilet transitions. Static sitting balance adequate for all seated ADL tasks without back support. Patient continues to require skilled OT for periodic functional reassessment."
  },
  {
    "category": "FUNCTIONAL_MOBILITY_BALANCE",
    "intervention": "Balance Decline Requiring Increased Assist",
    "narrative": "Patient exhibited declining balance and mobility skills this session, 2/2 progressive neurodegenerative condition. Assist level for ambulation upgraded from SBA to mod physical assist with RW over 20 ft, representing functional decline. Patient demonstrated increased loss of balance during transfers, requiring tactile cues to trunk and BLE for stability vs verbal cueing only at baseline. CGA upgraded to min assist for safety during all standing tasks. Patient continues to require skilled OT to slow decline and maximize remaining function."
  },
  {
    "category": "FUNCTIONAL_MOBILITY_BALANCE",
    "intervention": "Functional Mobility Deteriorating with Falls Risk",
    "narrative": "Patient facilitated in mobility tasks with noted decline in balance and coordination compared to prior evaluation. Patient now requires max assist of 1 for pivot transfers using RW, 2/2 severe BLE weakness (2/5 strength bilaterally) and impaired balance. Ambulation distance decreased from 50 ft to 10 ft before requiring rest break, demonstrating functional decline. Falls risk significantly increased requiring constant physical assist for all mobility tasks. Patient continues to require skilled OT for safety training, fall prevention strategies, and caregiver education."
  },
  {
    "category": "BED-CHAIR_TRANSFER_-_CONTACT_GUARD",
    "intervention": "Bed-Chair Transfer - Contact Guard",
    "narrative": "Therapeutic task training focused on functional transfer training (bed-to-chair) to improve transfer performance for [Patient Goal]. Contact guard at hips for safety to monitor balance and provide stabilization as needed, 2/2 impaired dynamic balance during transitional movements. Patient completed transfer with contact guard for safety, demonstrating improved technique vs requiring hand-held assist at baseline."
  },
  {
    "category": "BED_MOBILITY_-_MIN_VERBAL_CUES",
    "intervention": "Bed Mobility - Min Verbal Cues",
    "narrative": "Therapeutic task training focused on functional bed mobility to advance independence with position changes for [Patient Goal]. Min verbal cues to roll to right side for improved independence with functional positioning. Patient able to roll to right with 1-2 verbal cues vs 4-5 cues at baseline, 2/2 decreased trunk rotation and motor planning deficits. Patient continues to require skilled OT for ongoing cueing reduction and technique refinement."
  }
]
