[
  {
    "category": "BATHING",
    "intervention": "Bathing: Shower Transfer & Seated Washing",
    "narrative": "Skilled ADL training focused on shower transfer and UB washing to improve [Patient Goal]. Instruction provided in seated bathing techniques and proper long-handled sponge use to compensate for limited BLE ROM (<90° hip flexion bilaterally). Mod physical assist required for SPT from w/c to shower chair, 2/2 BLE weakness (3+/5 strength bilaterally) affecting weight-bearing safety. Patient able to wash face and BUE independently with setup, completing 50% of LB washing using long-handled sponge vs 0% independence at baseline. Patient demonstrated proper adaptive equipment technique and verbalized understanding of fall risk precautions. Fall risk precautions maintained throughout; no loss of balance events occurred."
  },
  {
    "category": "BATHING",
    "intervention": "Bathing: Graded Cueing Hierarchy",
    "narrative": "Bathing sequence completed with graded cueing hierarchy to improve [Patient Goal], targeting poor task initiation 2/2 cognitive deficits. Skilled clinical judgment applied to adjust cueing level based on patient's real-time performance and attention fluctuations. Verbal cues progressed from general to specific for washing/rinsing sequence. Min assist required to maintain balance while reaching outside BOS. Cues reduced from 8 to 5 by close of session, demonstrating progress in task initiation and improved attention to task. Patient continues to require skilled OT for cognitive cueing progression and safety monitoring during complex ADL tasks."
  },
  {
    "category": "BATHING",
    "intervention": "Bathing: Tub Transfer with Safety Focus",
    "narrative": "Skilled tub transfer and safety training performed to reduce fall risk during bathing. Instruction provided in safe transfer technique and proper grab bar placement/use. Hand-held assist required when ambulating 10 feet with RW to tub. Mod physical assist needed to complete leg lift into tub, 2/2 poor balance (Berg Balance score 35/56) and decreased proprioception limiting spatial awareness. Patient demonstrated improved safety awareness, verbalizing 3 of 4 key safety steps by close of session vs inability to recall at baseline. Fall risk precautions maintained; no adverse events occurred."
  },
  {
    "category": "BATHING",
    "intervention": "Bathing: Energy Conservation",
    "narrative": "Full bathing sequence completed with instruction in energy conservation techniques to improve [Patient Goal]. Seated bathing methods and pacing strategies incorporated to conserve energy during UB/LB washing, 2/2 post-surgical deconditioning. Max assist required for transfer from w/c to shower chair, 2/2 generalized weakness limiting functional mobility. Patient able to complete bathing tasks with 2 rest breaks vs continuous max assist with inability to complete at baseline, demonstrating improved activity tolerance. Patient verbalized understanding of pacing techniques and reported reduced perceived exertion compared to previous sessions."
  },
  {
    "category": "BATHING",
    "intervention": "Bathing: Assistive Device Instruction",
    "narrative": "UB hygiene and drying performed with skilled instruction in adaptive equipment use. Demonstration and structured practice provided for long-handled sponge and grab bar use for safety during reaching tasks. Min physical assist to complete drying of back and BLE, 2/2 limited shoulder ROM (flexion <120° bilaterally) restricting functional reach. Patient able to return-demonstrate proper technique with setup by close of session vs requiring hand-over-hand guidance at baseline. Patient correctly identified equipment purpose and safety benefits when queried."
  },
  {
    "category": "BATHING",
    "intervention": "Bathing: Tub Transfer & LB Washing (Complex Task)",
    "narrative": "Complex tub transfer and LB washing performed with skilled safety monitoring. Hand-held assist when ambulating 10 feet with RW to tub, 2/2 gait instability increasing fall risk. Mod physical assist to complete leg lift into tub. Seated on shower chair, Patient required CGA and tactile cues to wash B feet, 2/2 poor balance (sitting unsupported <30 sec) and decreased proprioception limiting spatial awareness. Clinical judgment applied to determine safe positioning and appropriate level of assistance. No loss of balance events; fall risk precautions maintained throughout."
  },
  {
    "category": "BATHING",
    "intervention": "Bathing: Full Sequence (Max Assist)",
    "narrative": "Full bathing sequence completed using shower chair to promote ADL participation and assess baseline functional status. Max assist required for transfer from w/c to chair, 2/2 generalized weakness (BLE strength 2/5, BUE strength 3/5). Physical assist to complete washing of LB and perineal area. Patient participated by washing chest and face with setup assistance. Tactile cues to BUE to facilitate washing hair. Patient continues to require skilled OT for task breakdown, graded assistance, and therapeutic progression toward improved bathing independence for discharge readiness."
  },
  {
    "category": "DRESSING",
    "intervention": "Dressing: LB Dressing (Hip Precautions)",
    "narrative": "Skilled LB dressing training performed with strict adherence to hip precautions to improve [Patient Goal]. Instruction in seated pants donning without hip flexion >90°, and proper sock aid/reacher use provided to prevent THA dislocation risk. Min assist required to thread pants over feet using reacher. Patient able to pull pants to hips in standing with SBA, progressed from mod assist at baseline. Patient correctly verbalized all 3 hip precautions (no flexion >90°, no adduction, no internal rotation) when queried, demonstrating understanding. Hip precautions maintained throughout; no precaution violations occurred."
  },
  {
    "category": "DRESSING",
    "intervention": "Dressing: UB Dressing (Hemi-Technique)",
    "narrative": "UB dressing completed with skilled instruction in hemi-dressing technique (affected arm first) for pullover shirt management. Mod physical assist to manage shirt over head and through affected LUE, 2/2 L hemiparesis (UE strength 2/5) affecting coordination and motor control. Tactile cues to scapula to promote protraction and improve arm positioning. Patient completed task with 40% less assist by close of session (mod assist → min-mod assist), demonstrating good motor learning potential. Patient able to verbalize proper sequencing when asked."
  },
  {
    "category": "DRESSING",
    "intervention": "Dressing: Fastener Management (Button Hook)",
    "narrative": "UB dressing with fastener management training performed to improve [Patient Goal]. Skilled demonstration and structured practice provided in proper button hook use technique and positioning. Mod physical assist required for button management, 2/2 fine motor deficits (pinch strength <5 lbs bilaterally). Patient able to fasten 3 of 5 buttons independently with button hook vs 0/5 at baseline, demonstrating functional improvement. Patient correctly demonstrated button hook setup technique when asked to return-demonstrate."
  },
  {
    "category": "DRESSING",
    "intervention": "Dressing: LB Dressing (Compensatory)",
    "narrative": "Skilled instruction provided in compensatory dressing techniques using reacher and dressing stick for donning pants while seated to improve [Patient Goal]. Therapeutic instruction focused on energy conservation and proper adaptive equipment use. Min assist for item management and positioning. By close of session, Patient able to hook belt loops and pull pants over knees independently vs max assist at baseline, demonstrating good learning potential and carryover of techniques. Patient verbalized understanding of equipment benefits and safety considerations."
  },
  {
    "category": "DRESSING",
    "intervention": "Dressing: Energy Conservation",
    "narrative": "Pants and shoes donned with instruction in energy conservation and work simplification techniques. Seated methods and pacing strategies incorporated to conserve energy, 2/2 decreased endurance (<3 METs activity tolerance) limiting sustained activity. Seated on firm surface, Patient able to don pants with min assist. Mod assist to don B shoes, 2/2 decreased endurance and fatigue. Patient completed task with 1 rest break vs inability to complete at baseline, demonstrating improved activity tolerance. Patient correctly identified 2 energy conservation techniques when queried."
  },
  {
    "category": "DRESSING",
    "intervention": "Dressing: UB Dressing (Button Shirt)",
    "narrative": "UB dressing with button-front shirt completed to advance fine motor skills. Mod physical assist required for button management, 2/2 fine motor deficits (decreased dexterity, pinch strength 4 lbs R, 3 lbs L). Patient able to orient shirt and place BUE into sleeves with SBA. Tactile cues to fingers to improve dexterity and motor planning for manipulating small buttons. Patient demonstrated improved finger positioning by close of session, requiring decreased physical guidance."
  },
  {
    "category": "DRESSING",
    "intervention": "Dressing: LB Dressing (Supine)",
    "narrative": "LB dressing and shoe donning tasks performed with bed mobility training integration. Shorts donned while supine with min assist to thread BLE. Patient able to pull waistband up over hips. Physical assist to complete last 75% of supine>sit EOB mobility sequence, 2/2 decreased core strength limiting transitional movements. Min assist to don B shoes, 2/2 decreased UE strength (3+/5 bilaterally). Patient continues to require skilled OT for therapeutic progression of bed mobility and supine dressing techniques."
  },
  {
    "category": "DRESSING",
    "intervention": "Dressing: LB Dressing (Simulation)",
    "narrative": "LB dressing simulation using theraband loop completed to improve BLE threading abilities and prepare for functional pants management. Compensatory techniques trained with therapeutic activity breakdown, 2/2 difficulty lifting RLE due to edema (2+ pitting to knee). Mod-Max physical assist required to stand from w/c, 2/2 BLE weakness affecting transfers. Patient unable to manage loop above hips, 2/2 decreased standing tolerance (<30 sec) and poor static balance. Skilled judgment applied to grade activity difficulty and modify task demands based on patient's fluctuating edema and pain levels."
  },
  {
    "category": "DRESSING",
    "intervention": "Dressing: Sock/Shoe Management (Adaptive Equipment)",
    "narrative": "Skilled instruction provided in sock aid and long-handled shoehorn use for LB dressing to improve [Patient Goal]. Demonstration and structured practice completed while seated in w/c. Mod physical assist to position sock aid initially, progressed to min verbal cues for technique refinement by close of session, demonstrating good motor learning. Patient able to don B socks independently with sock aid vs max assist at baseline. Patient able to return-demonstrate proper sock aid application technique and verbalized understanding of equipment setup."
  },
  {
    "category": "DRESSING",
    "intervention": "Dressing: UB Dressing (Standing Balance)",
    "narrative": "UB dressing with pullover shirt performed while standing with RW support to improve [Patient Goal] and advance dynamic balance during functional tasks. CGA required throughout task, 2/2 poor dynamic balance during transitional movements and trunk rotation. Verbal cues for proper sequencing and appropriate use of RW for stability. Patient able to complete task with 2 loss of balance events requiring physical assist to correct vs 5 balance losses at baseline. Fall risk precautions maintained; patient demonstrated improved safety awareness by reporting loss of balance before corrective assistance needed."
  },
  {
    "category": "DRESSING",
    "intervention": "Dressing: LB Dressing (Elastic Waistband)",
    "narrative": "LB dressing tasks performed while seated EOB to advance functional independence. Patient able to don pants with elastic waistband with min assist to thread BLE and pull to thighs. Mod physical assist required to stand and pull pants over hips, 2/2 decreased standing tolerance (<45 sec) and BLE weakness (3/5 strength) limiting sustained standing. Patient required 1 rest break during task completion vs 3 rest breaks at baseline, demonstrating improved endurance."
  },
  {
    "category": "DRESSING",
    "intervention": "Dressing: Full Sequence (Max Assist)",
    "narrative": "Full dressing sequence (UB and LB) completed to promote ADL participation and establish baseline functional status. Max physical assist required for all dressing tasks, 2/2 severe BLE weakness (2/5 strength bilaterally) and cognitive deficits affecting task sequencing and motor planning. Patient able to participate by holding shirt and attempting to push arms through sleeves with hand-over-hand guidance. Graded cues provided throughout session based on patient's fluctuating attention and processing speed. Patient continues to require skilled OT for therapeutic task breakdown, cognitive cueing strategies, and graded progression toward functional goals."
  },
  {
    "category": "DRESSING",
    "intervention": "Dressing: Cognitive Cueing (Sequencing)",
    "narrative": "LB dressing trained with graded cueing hierarchy to improve [Patient Goal], targeting sequencing deficits 2/2 cognitive impairment. Skilled clinical judgment applied to adjust cueing specificity based on patient's real-time performance. Verbal cues progressed from general to specific for proper sequencing of pants donning. Min physical assist for balance while standing. Patient required 6 verbal cues initially, reduced to 3 cues by close of session, demonstrating improved task sequencing and carryover of learned strategies. Patient continues to require skilled OT for ongoing cognitive strategy training and cueing reduction toward independence."
  },
  {
    "category": "DRESSING",
    "intervention": "Dressing: One-Handed Techniques",
    "narrative": "Skilled one-handed dressing training performed for shirt management, 2/2 RUE weakness limiting functional use. Demonstration provided for button-front shirt donning using L hand only with compensatory techniques. Mod physical assist to position shirt and complete fasteners, 2/2 RUE hemiparesis (2/5 strength) limiting bilateral tasks. Patient able to place L arm in sleeve independently and button 2 of 6 buttons with adapted technique vs 0/6 at baseline. Patient able to return-demonstrate setup technique with verbal prompting."
  },
  {
    "category": "DRESSING",
    "intervention": "Dressing: Bra Management (Seated)",
    "narrative": "Bra management training completed with instruction in front-clasp compensatory technique while seated. Skilled demonstration of donning bra backwards, clasping in front, and rotating to back provided with structured practice. Min assist to complete rotation and position straps over shoulders, 2/2 decreased shoulder ROM (flexion 110° R, 105° L) limiting overhead reach. Patient able to complete clasping independently vs mod assist at baseline, demonstrating functional improvement. Patient verbalized understanding of technique and correctly sequenced steps when asked."
  },
  {
    "category": "DRESSING",
    "intervention": "Dressing: Nightgown Management (Bed-Level)",
    "narrative": "Nightgown donning completed while supine in bed to establish bed-level dressing baseline. Mod physical assist to thread BUE through sleeves and position garment over head, 2/2 limited bed mobility and BUE weakness (3/5 strength bilaterally) restricting active movements. Patient able to assist by holding fabric and pulling down with min verbal cues for task participation vs passive positioning at baseline."
  },
  {
    "category": "DRESSING",
    "intervention": "Dressing: Winter Clothing (Complex Task)",
    "narrative": "Heavy jacket donning practiced while seated to improve [Patient Goal] and address complex clothing management. Mod physical assist to thread BUE through sleeves and manage zipper, 2/2 decreased BUE coordination and fine motor deficits (pinch strength <5 lbs) affecting fastener management. Verbal cues required to sequence multi-step task and maintain sitting balance during reaching movements. Task completed in 8 minutes with 1 rest break vs inability to complete at baseline. Skilled clinical judgment applied to grade task difficulty and modify assistance based on patient's fluctuating endurance."
  },
  {
    "category": "DRESSING",
    "intervention": "Dressing: Problem-Solving (Inside-Out Clothing)",
    "narrative": "UB dressing completed with cognitive problem-solving training to assess and improve executive function. Shirt intentionally placed inside-out to challenge visual perception and problem-solving abilities. Graded cues required to recognize and correct orientation of shirt, 2/2 cognitive deficits affecting visual perception and executive function. Patient able to identify problem with mod verbal cues and correct with min physical assist vs inability to recognize error at baseline, demonstrating improved awareness and problem-solving skills."
  },
  {
    "category": "DRESSING",
    "intervention": "Dressing: Decline (Increased Assist)",
    "narrative": "Declining dressing performance noted this session, 2/2 progressive physical and cognitive deficits. LB dressing now requires mod-max assist compared to min assist at prior evaluation, representing functional decline. Difficulty with task initiation and sequencing noted, requiring constant verbal cues vs intermittent cueing previously. Standing balance declined, requiring hand-held assist during all standing portions of dressing tasks vs SBA at baseline. Patient continues to require skilled OT to slow decline, maximize remaining function, and provide caregiver training for safe assistance techniques."
  },
  {
    "category": "DRESSING",
    "intervention": "Dressing: Maintenance (Adaptive Strategies)",
    "narrative": "Maintained dressing abilities demonstrated with compensatory strategies and adaptive equipment in place. UB dressing completed seated in w/c with button hook for fasteners and min assist for garment orientation. LB dressing performed with sock aid and long-handled shoehorn, requiring SBA for safety monitoring. Patient verbalized understanding of energy conservation techniques and completed full dressing routine with 2 rest breaks. Patient continues to require skilled OT for equipment assessment, strategy refinement, and periodic functional reassessment to maintain current independence level."
  },
  {
    "category": "DRESSING",
    "intervention": "Dressing: Layering (Temperature Regulation)",
    "narrative": "Multiple layers (undershirt, shirt, sweater) donned to improve [Patient Goal] and address complex clothing management. Skilled task analysis and pacing strategies provided, 2/2 decreased endurance (<3 METs tolerance) limiting sustained activity performance. Mod physical assist for first two layers, progressed to min assist for final layer, demonstrating improved motor learning with task repetition. Patient required 2 rest breaks to complete full sequence vs inability to complete at baseline, showing improved activity tolerance. Patient reported decreased perceived exertion with pacing techniques."
  },
  {
    "category": "DRESSING",
    "intervention": "Dressing: Garment Selection (Cognitive)",
    "narrative": "Clothing selection and dressing tasks completed with decision-making and executive function training. Graded cues required to select weather-appropriate clothing from dresser, 2/2 cognitive deficits affecting judgment, planning, and decision-making abilities. Min physical assist for LB dressing while seated. Patient able to identify appropriate garments with 3 verbal cues vs 7 cues at baseline, demonstrating improved cognitive performance and executive function. Patient continues to require skilled OT for ongoing cognitive strategy training."
  },
  {
    "category": "DRESSING",
    "intervention": "Dressing: Visual Field Deficit (Compensatory)",
    "narrative": "Compensatory scanning strategies trained during UB dressing to address L visual field deficit (L homonymous hemianopsia). Verbal cues to scan L side systematically when locating arm holes and aligning garments. Mod physical assist for shirt management, 2/2 difficulty orienting clothing and locating sleeves in neglected field. Patient able to demonstrate scanning technique with verbal prompts by close of session vs inability to scan without physical redirection at baseline. Patient verbalized understanding of compensation strategy when queried."
  },
  {
    "category": "DRESSING",
    "intervention": "Dressing: Clothing Management (W/C Level)",
    "narrative": "Clothing management training completed while seated in w/c to improve [Patient Goal] and advance organizational skills. Instruction provided in retrieving garments from dresser drawers and organizing items in lap for efficient sequencing. Min assist to open drawers and reach items on lower shelves. Patient able to fold and place doffed clothing on bedside table with SBA, demonstrating improved organization skills vs scattering items throughout room at baseline."
  },
  {
    "category": "DRESSING",
    "intervention": "Dressing: Clothing Management (Multiple Garments)",
    "narrative": "Training in management of multiple clothing items during dressing sequence performed to promote independence with [Patient Goal]. Skilled instruction provided in organizing undergarments, pants, and shirt in proper order before beginning task. Graded cues required to maintain attention to task and prevent confusion when managing several items, 2/2 cognitive deficits affecting working memory and planning. Patient completed task with 4 verbal cues vs 9 cues at baseline, demonstrating improved attention and task organization."
  },
  {
    "category": "DRESSING",
    "intervention": "Dressing: Safety During Transitions (Sit to Stand)",
    "narrative": "LB dressing with safety training during transitional movements performed to reduce fall risk. Skilled instruction in proper body mechanics and RW placement when standing to pull pants over hips. Mod physical assist required for sit<>stand transitions during dressing, 2/2 poor dynamic balance (unable to maintain tandem stance >5 sec) and decreased LE strength (3/5 bilaterally). Tactile cues to hips to facilitate forward weight shift. Patient demonstrated improved safety awareness with 1 loss of balance event vs 4 at baseline. Fall risk precautions maintained; no falls occurred."
  },
  {
    "category": "DRESSING",
    "intervention": "Dressing: Safety During Transitions (EOB Dressing)",
    "narrative": "LB dressing performed while seated EOB with safety focus during reaching movements to improve [Patient Goal]. Education on maintaining balance when leaning forward to reach feet provided with demonstration. CGA required throughout task, 2/2 poor sitting balance (unsupported sitting <45 sec) and increased fall risk. Patient able to don pants to knees with min verbal cues for pacing and proper forward lean vs mod physical assist at baseline. Patient verbalized understanding of safety strategies when queried."
  },
  {
    "category": "DRESSING",
    "intervention": "Dressing: W/C Level (Pants Management)",
    "narrative": "LB dressing completed entirely from w/c to improve [Patient Goal] and establish w/c-level independence. Skilled instruction in scooting techniques to lift hips and advance pants over buttocks while remaining seated. Max physical assist initially required for posterior weight shift and hip elevation, 2/2 decreased core strength (unable to bridge >2 sec) and poor body awareness. Tactile cues to hips provided for proprioceptive input. Patient able to advance pants 2 inches independently vs total assist at baseline, demonstrating early progress."
  },
  {
    "category": "DRESSING",
    "intervention": "Dressing: W/C Level (Full Sequence)",
    "narrative": "Full dressing sequence completed while remaining seated in w/c, 2/2 non-weight bearing precautions (R LE) requiring w/c-level ADL performance. UB dressing performed with min assist for garment orientation. LB dressing required mod-max physical assist for BLE management and threading through pants while seated. Skilled instruction in anterior weight shift and lateral scooting techniques provided to facilitate clothing advancement. Patient required 3 rest breaks to complete full sequence vs inability to tolerate activity at baseline. Patient continues to require skilled OT for therapeutic progression of w/c-level dressing techniques."
  },
  {
    "category": "DRESSING",
    "intervention": "Dressing: W/C Level (Adaptive Positioning)",
    "narrative": "Training in adaptive positioning for w/c-level dressing performed to promote safety during [Patient Goal]. Skilled instruction in proper brake engagement, armrest removal, and optimal seat positioning for improved LB access. Min assist to position Patient at front edge of w/c seat to facilitate forward reach. Mod physical assist for sock and shoe donning, 2/2 limited hip flexion ROM (<85° bilaterally) restricting ability to reach feet. Patient demonstrated improved positioning technique requiring 2 verbal cues vs 6 at baseline. Patient verbalized understanding of setup requirements when asked."
  },
  {
    "category": "FEEDING",
    "intervention": "Feeding: Adaptive Utensils (Arthritis)",
    "narrative": "Skilled intervention focused on self-feeding with adaptive utensils to improve [Patient Goal], 2/2 BUE arthritis limiting grasp and manipulation. Demonstration and structured practice provided for proper grasp of built-up handle utensils and optimal wrist positioning. After min assist for setup, Patient able to bring food to mouth for 10 repetitions vs 3 reps at baseline, demonstrating functional improvement. Patient able to return-demonstrate proper utensil grasp when asked."
  },
  {
    "category": "FEEDING",
    "intervention": "Feeding: Graded Cueing (Initiation)",
    "narrative": "Skilled interventions to facilitate independence with self-feeding abilities included initiation cues and instruction in proper hand-to-mouth sequencing. Patient guided in demonstration of hand-to-mouth sequence with hydration container. Graded cues required throughout session, 2/2 poor task initiation related to cognitive deficits affecting executive function. Increased processing time provided to facilitate problem-solving and motor planning. 80% of meal finished by close of session vs 40% at baseline. Patient continues to require skilled OT for ongoing cueing reduction and strategy training."
  },
  {
    "category": "FEEDING",
    "intervention": "Feeding: Swallow Safety & Positioning",
    "narrative": "Self-feeding with swallow safety awareness training performed to reduce aspiration risk. Skilled instruction in upright positioning technique (90° trunk angle) and appropriate bite size practice provided. Tactile cues required to maintain upright posture in w/c, 2/2 poor trunk control (slumped posture with kyphosis). Min physical assist for first 3 bites to establish proper technique. Patient maintained safe positioning and pacing for 50% of meal independently vs requiring constant cueing at baseline. Patient verbalized understanding of aspiration precautions when queried."
  },
  {
    "category": "FEEDING",
    "intervention": "Feeding: Adaptive Equipment (Universal Cuff)",
    "narrative": "Universal cuff use instructed to promote independence for [Patient Goal], 2/2 severe BUE weakness limiting grasp. Skilled instruction in application, adjustment technique, and optimal utensil placement provided. Mod physical assist to secure utensil in cuff, 2/2 severe BUE weakness (2/5 strength bilaterally). Patient able to perform shoulder and elbow movements to bring food to mouth for 8/10 bites vs 2/10 at baseline. Patient able to return-demonstrate cuff application with setup assistance."
  },
  {
    "category": "FEEDING",
    "intervention": "Feeding: Adaptive Equipment (Rocker Knife)",
    "narrative": "Cutting food with rocker knife performed for one-handed cutting technique training. Skilled demonstration and practice of rocking motion provided. Min assist to stabilize plate and position food. By close of session, Patient able to cut and consume 3/4 of meal independently vs total assist at baseline, indicating good learning potential and functional carryover. Patient correctly demonstrated rocker knife technique when asked to return-demonstrate."
  },
  {
    "category": "FEEDING",
    "intervention": "Feeding: Hand-Over-Hand (Hemi-focus)",
    "narrative": "Feeding tasks performed while supine in bed with head elevated to 45°. Mod spillage noted at start of treatment. Max physical assist to use L hand as a dependent stabilizer; hand-over-hand assist and min verbal cues required to improve ability to bring spoon to mouth, 2/2 R hemiparesis affecting dominant hand coordination. By close of session, Patient able to hold container with L hand and use R hand to scoop food vs requiring bilateral hand-over-hand at baseline. Patient continues to require skilled OT for ongoing hemi-training and bilateral coordination."
  },
  {
    "category": "TOILETING",
    "intervention": "Toileting: Transfer Training (Standard Commode)",
    "narrative": "Toileting routine with toilet transfer training performed to improve [Patient Goal]. Skilled instruction in stand-pivot technique with proper weight shifting and grab bar use provided. Hand-held assist when ambulating 20 feet to standard commode, 2/2 gait instability. Min assist and grab bar required for sit<>stand, 2/2 low standard commode height requiring increased LE strength. Patient verbalized understanding of safety techniques. Fall risk precautions maintained; no balance losses occurred."
  },
  {
    "category": "TOILETING",
    "intervention": "Toileting: Adaptive Equipment (Raised Seat)",
    "narrative": "Toileting routine performed utilizing grab bar and raised toilet seat to improve [Patient Goal] and reduce fall risk. Min physical assist to facilitate standing from w/c with verbal cues for safe SPT w/c<>raised commode. Mod physical assist required for clothing management, 2/2 decreased LUE motor control (3/5 strength) limiting bilateral tasks. Patient able to demonstrate proper grab bar use when prompted. No adverse events; fall risk precautions maintained."
  },
  {
    "category": "TOILETING",
    "intervention": "Toileting: Clothing Management (Seated)",
    "narrative": "Toilet transfer and hygiene with clothing management training completed. Skilled instruction in seated garment management techniques provided to conserve energy and improve safety. Max assist for pivot transfer from bed to bedside commode, 2/2 BLE paralysis limiting mobility. Patient able to participate in clothing adjustment with hand-over-hand guidance vs total assist with passive positioning at baseline, demonstrating improved participation."
  },
  {
    "category": "TOILETING",
    "intervention": "Toileting: Safety & Mobility",
    "narrative": "Toileting tasks in bathroom performed with safety focus. Patient ambulated 15 ft with RW and SBA for safety monitoring. Min assist required for sit<>stand from toilet. Tactile cues to gluteals to ensure proper seating depth and positioning. CGA to manage clothing over B LEs, 2/2 poor balance (unable to maintain single leg stance >3 sec) increasing fall risk during standing clothing management. Fall risk precautions maintained; no loss of balance events occurred."
  },
  {
    "category": "TOILETING",
    "intervention": "Toileting: Hygiene Techniques (Adaptive Tools)",
    "narrative": "Commode transfer post-toileting with hygiene technique training completed. Skilled instruction in toilet paper management and extended reach wiping methods with adaptive tools provided. Mod physical assist to complete SPT with RW. Physical assist for hygiene tasks, 2/2 decreased endurance (<3 METs tolerance) and limited ROM restricting functional reach. Patient able to return-demonstrate proper adaptive tool positioning with verbal cueing."
  },
  {
    "category": "TOILETING",
    "intervention": "Toileting & LB Dressing (Complex Task)",
    "narrative": "Patient facilitated in toileting routine and LB dressing tasks to improve [Patient Goal]. Hand-held assist when ambulating 30 feet to standard commode. Min assist and grab bar required for sit<>stand, 2/2 low commode height. CGA for clothing management during standing tasks. Seated on firm surface without back support, Patient able to don pants with drawstring waistband with min assist and RW to assume standing posture. Verbal cues for improved ankle strategies when doffing pants, 2/2 decreased hip flexion ROM (<90° bilaterally) limiting forward reach. Fall risk precautions maintained throughout."
  },
  {
    "category": "TOILETING",
    "intervention": "Toileting: Hygiene (Max Assist)",
    "narrative": "Toileting routine performed utilizing grab bar and raised commode to establish baseline functional status. Min physical assist to facilitate standing from w/c with min verbal cues for safe SPT w/c<>raised commode. Patient verbalized difficulty performing LB hygiene tasks; skilled compensatory strategies implemented and trialed. Patient required max assist for hygiene tasks, 2/2 difficulty reaching perineal area related to limited trunk/hip flexion ROM. Patient continues to require skilled OT for compensatory technique training and adaptive equipment assessment."
  },
  {
    "category": "TOILETING",
    "intervention": "Toileting: Complex (Cognitive Deficits)",
    "narrative": "Patient facilitated in toileting routine, brief change/management, and UB dressing to promote [Patient Goal]. Mod physical assistance with verbal and visual cues required to complete toileting tasks safely, 2/2 cognitive deficits affecting sequencing, safety judgment, and motor planning for pivoting, cleaning the body, adjusting clothing, and obtaining supplies. Decreased safety awareness noted with impulsive movements. Patient continues to require skilled OT for ongoing cognitive cueing strategies and safety training."
  },
  {
    "category": "GROOMING",
    "intervention": "Grooming: Technique Instruction (Oral Care)",
    "narrative": "Grooming tasks with skilled technique instruction in proper toothbrushing performed to establish correct motor patterns and improve oral hygiene. Demonstration of proper technique and verbal cues for sequencing provided. W/c seating required, 2/2 poor standing tolerance (<2 min unsupported). Min assist to manage toothpaste on brush. Patient able to complete oral care with improved technique, addressing 8/10 tooth surfaces vs 5/10 at baseline. Patient able to return-demonstrate proper brushing motion when prompted."
  },
  {
    "category": "GROOMING",
    "intervention": "Grooming: Adaptive Equipment (Long-Handled Tools)",
    "narrative": "UB hygiene with skilled instruction in use of long-handled tools completed. Demonstration of long-handled brush use for hair care provided with structured practice. Patient used bedside table for BUE support to conserve energy. Min physical assist to complete combing back of head, 2/2 decreased shoulder ROM (flexion <115° bilaterally) limiting overhead reach. Patient completed 75% of task independently with adaptive equipment vs requiring total assist at baseline. Patient correctly identified equipment purpose when asked."
  },
  {
    "category": "GROOMING",
    "intervention": "Grooming: Graded Cueing (Apraxia)",
    "narrative": "Oral care and facial hygiene with graded cueing hierarchy performed to improve [Patient Goal], targeting apraxia affecting motor planning. Physical guidance with systematic fading of assistance to bring toothbrush to mouth, 2/2 apraxia impairing motor sequencing and tool use. Tactile cues to cheeks and chin during face washing to facilitate awareness. Patient required mod physical assist initially, progressed to min verbal cues by close of session, demonstrating improved motor planning with repetition. Patient continues to require skilled OT for ongoing apraxia treatment and cueing reduction."
  },
  {
    "category": "GROOMING",
    "intervention": "Grooming: Safety (Shaving)",
    "narrative": "Shaving with safety training completed to reduce risk during sharp object use. Demonstration of electric razor use and instruction in safe technique provided, 2/2 L visual field deficit impacting safety awareness and ability to visualize all facial areas. CGA required for safety to ensure all areas addressed and proper scanning employed. Patient able to hold razor and operate independently. Completed task seated in w/c with SBA. Patient verbalized understanding of scanning strategy when queried."
  },
  {
    "category": "GROOMING",
    "intervention": "Grooming: Energy Conservation (Standing)",
    "narrative": "Full grooming routine (oral care, hair, face) with energy conservation training completed to improve activity tolerance. Skilled instruction in seated techniques and pacing strategies provided. Patient stood at sink with RW for 5 minutes vs 2 minutes at baseline, demonstrating improved standing tolerance. Min assist for reaching and item management. Patient demonstrated improved activity tolerance with 1 rest break vs 3 breaks at baseline. Patient correctly identified 2 pacing strategies when asked."
  },
  {
    "category": "GROOMING",
    "intervention": "Grooming: Sustained Performance (Maintenance)",
    "narrative": "Maintained grooming and hygiene skills demonstrated with use of adaptive equipment and compensatory strategies. Patient able to complete oral care, face washing, and hair care seated at sink with built-up handled tools and SBA for safety. Min assist required for items requiring bilateral manipulation including toothpaste tube. Patient demonstrated proper sequencing and safety awareness throughout 12-minute grooming routine vs requiring constant cueing at prior evaluation. Patient continues to require skilled OT for periodic reassessment and equipment modification as needed."
  },
  {
    "category": "GROOMING",
    "intervention": "Grooming: Decline (Progressive Deficits)",
    "narrative": "Declining grooming performance noted this session, 2/2 progressive cognitive and motor deficits. Mod-max verbal cues now required for sequencing basic hygiene tasks compared to min cues at prior evaluation, representing functional decline. Patient demonstrated difficulty with motor planning for oral care, requiring hand-over-hand guidance for 50% of task vs verbal cueing only previously. Safety awareness decreased, requiring constant supervision vs intermittent monitoring at baseline. Patient continues to require skilled OT to slow decline and provide caregiver training in safe assistance techniques."
  },
  {
    "category": "IADL",
    "intervention": "IADL: Meal Prep (Planning Skills)",
    "narrative": "Light meal prep (sandwich making) completed to improve [Patient Goal] and advance cognitive planning skills. Skilled task analysis and breakdown practice provided while seated, 2/2 decreased standing tolerance (<3 min). Min assist to open containers and retrieve items. Patient able to demonstrate 4-step sequence independently vs 2 steps at baseline, showing improved executive function and task organization. Patient verbalized understanding of sequencing when asked to repeat steps."
  },
  {
    "category": "IADL",
    "intervention": "IADL: Medication Management (Decision Making)",
    "narrative": "Medication management with decision-making skills training performed to improve safety and cognitive function. Skilled instruction in supply selection and product usage decisions for 7-day pill organizer provided. Graded cues required to accurately fill organizer, 2/2 cognitive deficits affecting task sequencing, visual discrimination, and safety judgment. Mod physical assist for opening bottles. Patient correctly identified 2 of 4 medications when queried vs 0/4 at baseline. Patient continues to require skilled OT for ongoing safety training and cognitive strategy development."
  },
  {
    "category": "IADL",
    "intervention": "IADL: Light Housekeeping (Safety)",
    "narrative": "Light housekeeping performed with safety training to reduce fall risk during IADLs. Skilled instruction in balance preservation strategies provided while wiping counters standing with RW support. CGA for safety and balance monitoring throughout dynamic reaching tasks. Tactile cues to trunk required to prevent loss of balance during reaching tasks. Fall risk precautions maintained; no loss of balance events occurred. Patient verbalized understanding of safety positioning when asked."
  },
  {
    "category": "IADL",
    "intervention": "IADL: Retrieving Items (Reacher)",
    "narrative": "Item retrieval with skilled instruction in reacher use completed to improve [Patient Goal]. Demonstration and practice provided to obtain light items from cabinet while seated in w/c. Min assist to maneuver w/c in tight spaces. Patient able to retrieve 3 of 4 items independently with reacher vs 0/4 at baseline, demonstrating functional improvement. Patient able to return-demonstrate proper reacher grasp technique when prompted."
  },
  {
    "category": "IADL",
    "intervention": "IADL: Meal Prep (Energy Conservation)",
    "narrative": "Simple cold meal preparation with energy conservation training performed to improve activity tolerance. Skilled instruction in activity pacing and work simplification strategies for pouring milk into cereal provided. Patient carried bowl and milk to table with min assist using RW basket, 2/2 impaired balance during ambulation with weighted items. Patient completed task with 1 rest break vs inability to complete at baseline, demonstrating improved endurance. Patient correctly identified 2 energy conservation techniques when queried."
  },
  {
    "category": "IADL",
    "intervention": "IADL: Housekeeping (Scooting)",
    "narrative": "Lateral scooting tasks to R and L sides (EOB) performed to increase trunk stability and gross motor coordination for [Patient Goal]. Mod assist required for sequencing of task and proper hand/foot placement to improve task performance, 2/2 decreased BUE strength (3/5 bilaterally) and trunk control deficits. Skilled instruction in weight shifting and positioning techniques provided."
  },
  {
    "category": "IADL",
    "intervention": "IADL: Housekeeping (Standing)",
    "narrative": "Light housekeeping task (folding laundry) performed while standing (unsupported/supported with RW) to increase functional activity tolerance and standing endurance. Patient educated on energy conservation and work simplification techniques, with min verbal cues for activity pacing. Min assist required to maintain standing balance, 2/2 loss of balance x2 during prolonged standing. Patient able to stand for 8 min vs 4 min at baseline. Fall risk precautions maintained throughout."
  },
  {
    "category": "IADL",
    "intervention": "IADL: Maintenance (Compensatory Strategies)",
    "narrative": "Maintained IADL performance demonstrated with environmental modifications and adaptive strategies in place. Patient able to complete light meal prep seated at table with items within reach and min assist for heavy lifting. Medication management maintained with use of pre-filled organizer and written schedule. Patient able to manage simple cleaning tasks with long-handled tools and frequent rest breaks. Patient continues to require skilled OT for periodic reassessment, equipment modification, and strategy refinement to maintain current independence level."
  },
  {
    "category": "IADL",
    "intervention": "IADL: Decline (Cognitive/Physical)",
    "narrative": "Declining performance in home management tasks noted this session, 2/2 progressive cognitive and physical decline. Meal preparation now requires mod-max assist compared to min assist at prior evaluation, representing functional decline. Patient demonstrated difficulty with sequencing multi-step tasks, completing only 2 of 5 steps independently vs 4/5 previously. Safety concerns noted with stove use, requiring constant supervision vs intermittent monitoring at baseline. Patient continues to require skilled OT to slow decline, maximize remaining function, and provide caregiver training for safety."
  },
  {
    "category": "IADL",
    "intervention": "IADL: Medication Management (Maintenance)",
    "narrative": "Maintained medication management skills demonstrated with compensatory strategies in place. Patient able to identify correct medications and dosing schedule with use of pre-filled weekly organizer and written instructions. Min verbal cues required to check medication list against bottles. Patient correctly self-administered medications from organizer with SBA for safety monitoring. Patient continues to require skilled OT for periodic safety reassessment and strategy reinforcement to maintain independence and prevent medication errors."
  }
]
