[
  {
    "category": "BATHING",
    "intervention": "Bathing: Shower Transfer & Seated Washing",
    "narrative": "Skilled interventions focused on shower transfer and UB washing to improve [Patient Goal]. Instruction provided in seated bathing techniques and use of long-handled sponge to address limited BLE ROM. Mod physical assist was required for SPT from w/c to shower chair, 2/2 BLE weakness affecting weight-bearing ability. Patient able to wash face and BUE independently, with 50% of LB completed using long-handled sponge after skilled demonstration."
  },
  {
    "category": "BATHING",
    "intervention": "Bathing: Graded Cueing Hierarchy",
    "narrative": "Bathing sequence completed with graded cueing hierarchy to improve [Patient Goal], targeting poor task initiation. Verbal cues progressed from general to specific for washing/rinsing sequence. Min assist required to maintain balance while reaching outside base of support. Cues reduced from 8 to 5 by close of session, demonstrating progress in task initiation."
  },
  {
    "category": "BATHING",
    "intervention": "Bathing: Tub Transfer with Safety Focus",
    "narrative": "To reduce fall risk during bathing, tub transfer with safety training performed. Skilled instruction provided in safe transfer technique and proper grab bar use. Hand-held assist required when ambulating 10 feet with RW to tub. Mod physical assist needed to complete leg lift into tub, 2/2 poor balance and decreased proprioception. Patient demonstrated improved safety awareness by close of session."
  },
  {
    "category": "BATHING",
    "intervention": "Bathing: Energy Conservation",
    "narrative": "Full bathing sequence completed with instruction in energy conservation to improve [Patient Goal]. Seated techniques and pacing strategies incorporated to conserve energy during UB/LB washing. Max assist required for transfer from w/c to shower chair, 2/2 generalized weakness. Patient able to complete bathing tasks with 2 rest breaks vs continuous max assist at baseline."
  },
  {
    "category": "BATHING",
    "intervention": "Bathing: Assistive Device Instruction",
    "narrative": "UB hygiene and drying performed with instruction in use of assistive devices. Skilled demonstration and practice provided for long-handled sponge and grab bar use for safety. Min physical assist to complete drying of back and BLE, 2/2 limited ROM restricting functional reach. Patient able to demonstrate proper technique with setup by close of session."
  },
  {
    "category": "BATHING",
    "intervention": "Bathing: Tub Transfer & LB Washing (Complex Task)",
    "narrative": "Tub transfer and LB washing performed. Hand-held assist when ambulating 10 feet with RW to tub. Mod physical assist to complete leg lift into tub. Seated on shower chair, Patient required CGA and tactile cues to wash B feet, 2/2 poor balance increasing fall risk and decreased proprioception."
  },
  {
    "category": "BATHING",
    "intervention": "Bathing: Full Sequence (Max Assist)",
    "narrative": "Full bathing sequence completed using shower chair. Max assist for transfer from w/c to chair, 2/2 generalized weakness. Physical assist to complete washing of LB and perineal area. Patient participated by washing chest and face. Tactile cues to BUE to assist with washing hair."
  },
  {
    "category": "DRESSING",
    "intervention": "Dressing: LB Dressing (Hip Precautions)",
    "narrative": "Due to hip precautions, lower extremity dressing techniques trained to improve [Patient Goal]. Skilled instruction in seated pants donning and proper sock aid use provided. Min assist required to thread B pants over feet using reacher. Patient able to pull pants to hips in standing with SBA, progressed from mod assist at baseline."
  },
  {
    "category": "DRESSING",
    "intervention": "Dressing: UB Dressing (Hemi-Technique)",
    "narrative": "UB dressing completed with instruction in affected arm first technique for pullover shirt management. Mod physical assist to manage shirt over head and through affected LUE, 2/2 hemiparesis affecting UE coordination. Tactile cues to scapula to promote protraction. Patient completed task with 40% less assist by close of session."
  },
  {
    "category": "DRESSING",
    "intervention": "Dressing: Fastener Management (Button Hook)",
    "narrative": "UB dressing with fastener management training performed to improve [Patient Goal]. Instruction and practice provided in proper button hook use technique. Mod physical assist required for button management, 2/2 fine motor deficits. Patient able to fasten 3 of 5 buttons independently with button hook vs 0/5 at baseline."
  },
  {
    "category": "DRESSING",
    "intervention": "Dressing: LB Dressing (Compensatory)",
    "narrative": "Skilled instruction provided in reacher and dressing stick use for donning pants while seated to improve [Patient Goal]. Min assist for item management. By close of session, Patient able to hook belt loops and pull pants over knees independently vs max assist at baseline, demonstrating good learning potential."
  },
  {
    "category": "DRESSING",
    "intervention": "Dressing: Energy Conservation",
    "narrative": "Pants and shoes donned with instruction in energy conservation. Seated techniques and pacing strategies incorporated to conserve energy. Seated on firm surface, Patient able to donn pants with min assist. Mod assist to donn B shoes, 2/2 decreased endurance. Patient completed task with 1 rest break vs inability to complete at baseline."
  },
  {
    "category": "DRESSING",
    "intervention": "Dressing: UB Dressing (Button Shirt)",
    "narrative": "UB dressing with button-front shirt completed. Mod physical assist required for button management, 2/2 fine motor deficits. Patient able to orient shirt and place BUE into sleeves with SBA. Tactile cues to fingers to improve dexterity for manipulating small buttons."
  },
  {
    "category": "DRESSING",
    "intervention": "Dressing: LB Dressing (Supine)",
    "narrative": "LB dressing and shoe donning tasks performed. Shorts donned while supine with min assist to thread BLE. Patient able to pull waistband up over hips. Physical assist to complete last 75% of supine>sit EOB mobility sequence. Min assist to donn B shoes, 2/2 decreased muscle strength."
  },
  {
    "category": "DRESSING",
    "intervention": "Dressing: LB Dressing (Simulation)",
    "narrative": "LB dressing simulation using theraband loop completed to improve BLE threading abilities. Compensatory techniques trained, 2/2 difficulty lifting RLE due to edema. Mod-Max physical assist required to stand from w/c. Patient unable to manage loop above hips, secondary to decreased standing tolerance and stability."
  },
  {
    "category": "DRESSING",
    "intervention": "Dressing: Sock/Shoe Management (Adaptive Equipment)",
    "narrative": "Instruction provided in sock aid and long-handled shoehorn use for LB dressing to improve [Patient Goal]. Skilled demonstration and practice completed while seated in w/c. Mod physical assist to position sock aid initially, progressed to min verbal cues for technique by close of session. Patient able to donn B socks independently with sock aid vs max assist at baseline."
  },
  {
    "category": "DRESSING",
    "intervention": "Dressing: UB Dressing (Standing Balance)",
    "narrative": "To improve [Patient Goal], UB dressing with pullover shirt performed while standing with RW support. CGA required throughout task, 2/2 poor dynamic balance during transitional movements. Verbal cues for proper sequencing and use of RW for stability. Patient able to complete task with 2 loss of balance events requiring physical assist to correct."
  },
  {
    "category": "DRESSING",
    "intervention": "Dressing: LB Dressing (Elastic Waistband)",
    "narrative": "LB dressing tasks performed while seated EOB. Patient able to donn pants with elastic waistband with min assist to thread BLE and pull to thighs. Mod physical assist required to stand and pull pants over hips, 2/2 decreased standing tolerance and BLE weakness. Patient required 1 rest break during task completion."
  },
  {
    "category": "DRESSING",
    "intervention": "Dressing: Full Sequence (Max Assist)",
    "narrative": "Full dressing sequence (UB and LB) completed to promote participation during ADLs. Max physical assist required for all dressing tasks, 2/2 severe BLE weakness and cognitive deficits affecting task sequencing. Patient able to participate by holding shirt and attempting to push arms through sleeves with hand-over-hand guidance. Graded cues provided throughout session."
  },
  {
    "category": "DRESSING",
    "intervention": "Dressing: Cognitive Cueing (Sequencing)",
    "narrative": "LB dressing trained with graded cueing hierarchy to improve [Patient Goal]. Verbal cues progressed from general to specific for proper sequencing of pants donning. Min physical assist for balance while standing. Patient required 6 verbal cues initially, reduced to 3 cues by close of session, demonstrating improved task sequencing."
  },
  {
    "category": "DRESSING",
    "intervention": "Dressing: One-Handed Techniques",
    "narrative": "Due to RUE weakness, one-handed dressing techniques trained for shirt management. Skilled demonstration provided for button-front shirt donning using L hand only. Mod physical assist to position shirt and complete fasteners, 2/2 RUE hemiparesis limiting functional use. Patient able to place L arm in sleeve independently and button 2 of 6 buttons with adapted technique."
  },
  {
    "category": "DRESSING",
    "intervention": "Dressing: Bra Management (Seated)",
    "narrative": "Bra management training completed with instruction in front-clasp technique while seated. Skilled demonstration of donning bra backwards, clasping in front, and rotating. Min assist to complete rotation and position straps over shoulders, 2/2 decreased shoulder ROM limiting overhead reach. Patient able to complete clasping independently vs mod assist at baseline."
  },
  {
    "category": "DRESSING",
    "intervention": "Dressing: Nightgown Management (Bed-Level)",
    "narrative": "Nightgown donning completed while supine in bed. Mod physical assist to thread BUE through sleeves and position garment over head, 2/2 limited bed mobility and BUE weakness. Patient able to assist by holding fabric and pulling down with min verbal cues for task participation."
  },
  {
    "category": "DRESSING",
    "intervention": "Dressing: Winter Clothing (Complex Task)",
    "narrative": "Heavy jacket donning practiced while seated to improve [Patient Goal]. Mod physical assist to thread BUE through sleeves and manage zipper, 2/2 decreased BUE coordination and fine motor deficits affecting fastener management. Verbal cues required to sequence task and maintain sitting balance during reaching movements. Task completed in 8 minutes with 1 rest break."
  },
  {
    "category": "DRESSING",
    "intervention": "Dressing: Problem-Solving (Inside-Out Clothing)",
    "narrative": "UB dressing completed with problem-solving training. Shirt was intentionally placed inside-out to assess cognitive abilities. Graded cues required to recognize and correct orientation of shirt, 2/2 cognitive deficits affecting visual perception and problem-solving. Patient able to identify problem with mod verbal cues and correct with min physical assist."
  },
  {
    "category": "DRESSING",
    "intervention": "Dressing: Decline (Increased Assist)",
    "narrative": "Declining dressing performance noted, 2/2 progressive physical and cognitive deficits. LB dressing now requires mod-max assist compared to min assist at baseline. Difficulty with task initiation and sequencing noted, requiring constant verbal cues. Standing balance declined, requiring hand-held assist during all standing portions of dressing tasks."
  },
  {
    "category": "DRESSING",
    "intervention": "Dressing: Maintenance (Adaptive Strategies)",
    "narrative": "Maintained dressing abilities demonstrated with compensatory strategies in place. UB dressing completed seated in w/c with button hook for fasteners and min assist for garment orientation. LB dressing performed with sock aid and long-handled shoehorn, requiring SBA for safety. Patient verbalized understanding of energy conservation techniques and completed full dressing routine with 2 rest breaks."
  },
  {
    "category": "DRESSING",
    "intervention": "Dressing: Layering (Temperature Regulation)",
    "narrative": "Multiple layers (undershirt, shirt, sweater) donned to improve [Patient Goal]. Task analysis and pacing strategies provided, 2/2 decreased endurance limiting sustained activity performance. Mod physical assist for first two layers, progressed to min assist for final layer. Patient required 2 rest breaks to complete full sequence vs inability to complete at baseline."
  },
  {
    "category": "DRESSING",
    "intervention": "Dressing: Garment Selection (Cognitive)",
    "narrative": "Clothing selection and dressing tasks completed with decision-making training. Graded cues required to select weather-appropriate clothing from dresser, 2/2 cognitive deficits affecting judgment and planning. Min physical assist for LB dressing while seated. Patient able to identify appropriate garments with 3 verbal cues vs 7 cues at baseline, demonstrating improved cognitive performance."
  },
  {
    "category": "DRESSING",
    "intervention": "Dressing: Visual Field Deficit (Compensatory)",
    "narrative": "Due to L visual field deficit, compensatory scanning strategies trained during UB dressing. Verbal cues to scan L side when locating arm holes and aligning garments. Mod physical assist for shirt management, 2/2 difficulty orienting clothing and locating sleeves. Patient able to demonstrate scanning technique with verbal prompts by close of session."
  },
  {
    "category": "DRESSING",
    "intervention": "Dressing: Clothing Management (W/C Level)",
    "narrative": "Clothing management training completed while seated in w/c to improve [Patient Goal]. Instruction provided in retrieving garments from dresser drawers and organizing items in lap for efficient sequencing. Min assist to open drawers and reach items on lower shelves. Patient able to fold and place doffed clothing on bedside table with SBA, demonstrating improved organization skills vs scattering items at baseline."
  },
  {
    "category": "DRESSING",
    "intervention": "Dressing: Clothing Management (Multiple Garments)",
    "narrative": "Training in management of multiple clothing items during dressing sequence performed to promote independence with [Patient Goal]. Instruction provided in organizing undergarments, pants, and shirt in proper order before beginning task. Graded cues required to maintain attention to task and prevent confusion when managing several items, 2/2 cognitive deficits affecting planning. Patient completed task with 4 verbal cues vs 9 cues at baseline."
  },
  {
    "category": "DRESSING",
    "intervention": "Dressing: Safety During Transitions (Sit to Stand)",
    "narrative": "LB dressing with safety training during transitional movements performed to reduce fall risk. Instruction in proper body mechanics and RW placement when standing to pull pants over hips. Mod physical assist required for sit<>stand transitions during dressing, 2/2 poor dynamic balance and decreased LE strength. Tactile cues to hips to facilitate forward weight shift. Patient demonstrated improved safety awareness with 1 loss of balance event vs 4 at baseline."
  },
  {
    "category": "DRESSING",
    "intervention": "Dressing: Safety During Transitions (EOB Dressing)",
    "narrative": "To improve [Patient Goal], LB dressing performed while seated EOB with safety focus during reaching movements. Education on maintaining balance when leaning forward to reach feet provided. CGA required throughout task, 2/2 poor sitting balance and increased fall risk. Patient able to donn pants to knees with min verbal cues for pacing and proper forward lean vs mod physical assist at baseline."
  },
  {
    "category": "DRESSING",
    "intervention": "Dressing: W/C Level (Pants Management)",
    "narrative": "LB dressing completed entirely from w/c to improve [Patient Goal]. Skilled instruction in scooting techniques to lift hips and advance pants over buttocks while remaining seated. Max physical assist initially required for posterior weight shift and hip elevation, 2/2 decreased core strength and poor body awareness. Tactile cues to hips provided. Patient able to advance pants 2 inches independently vs total assist at baseline."
  },
  {
    "category": "DRESSING",
    "intervention": "Dressing: W/C Level (Full Sequence)",
    "narrative": "Full dressing sequence completed while remaining seated in w/c, 2/2 non-weight bearing precautions. UB dressing performed with min assist for garment orientation. LB dressing required mod-max physical assist for BLE management and threading through pants while seated. Instruction in anterior weight shift and lateral scooting techniques provided to facilitate clothing advancement. Patient required 3 rest breaks to complete full sequence vs inability to tolerate at baseline."
  },
  {
    "category": "DRESSING",
    "intervention": "Dressing: W/C Level (Adaptive Positioning)",
    "narrative": "Training in adaptive positioning for w/c-level dressing performed to promote safety during [Patient Goal]. Instruction in proper brake engagement and armrest removal for improved access to LB. Min assist to position Patient at front edge of w/c seat to facilitate forward reach. Mod physical assist for sock and shoe donning, 2/2 limited hip flexion ROM restricting ability to reach feet. Patient demonstrated improved positioning technique requiring 2 verbal cues vs 6 at baseline."
  },
  {
    "category": "FEEDING",
    "intervention": "Feeding: Adaptive Utensils (Arthritis)",
    "narrative": "Skilled intervention focused on self-feeding with adaptive utensils to improve [Patient Goal], 2/2 BUE arthritis. Demonstration and practice provided for proper grasp of built-up handle utensils. After min assist for setup, Patient able to bring food to mouth for 10 repetitions, progressed from 3 reps at baseline."
  },
  {
    "category": "FEEDING",
    "intervention": "Feeding: Graded Cueing (Initiation)",
    "narrative": "Skilled interventions to facilitate independence with self-feeding abilities included initiation cues and instruction in proper sequencing. Patient guided in demonstration of hand-to-mouth sequence with hydration container. Graded cues required throughout session, secondary to poor task initiation. Increased time provided to facilitate processing and problem-solving. 80% of meal finished by close of session."
  },
  {
    "category": "FEEDING",
    "intervention": "Feeding: Swallow Safety & Positioning",
    "narrative": "Self-feeding with swallow safety awareness training performed. Instruction in upright positioning technique and appropriate bite size practice provided. Tactile cues required to maintain upright posture in w/c, 2/2 poor trunk control. Min physical assist for first 3 bites. Patient maintained safe positioning and pacing for 50% of meal independently."
  },
  {
    "category": "FEEDING",
    "intervention": "Feeding: Adaptive Equipment (Universal Cuff)",
    "narrative": "To promote independence for [Patient Goal], universal cuff use instructed. Instruction in application and adjustment technique provided. Mod physical assist to secure utensil in cuff, 2/2 severe BUE weakness. Patient able to perform shoulder and elbow movements to bring food to mouth for 8/10 bites."
  },
  {
    "category": "FEEDING",
    "intervention": "Feeding: Adaptive Equipment (Rocker Knife)",
    "narrative": "Cutting food with rocker knife performed for one-handed cutting technique. Min assist to stabilize plate. By close of session, Patient able to cut and consume 3/4 of meal independently vs total assist at baseline, indicating good learning potential."
  },
  {
    "category": "FEEDING",
    "intervention": "Feeding: Hand-Over-Hand (Hemi-focus)",
    "narrative": "Feeding tasks performed while supine in bed with head elevated. Mod spillage noted at start of tx. Max physical assist to use L hand as a dependent stabilizer; hand-over-hand assist and min verbal cues required to improve ability to bring spoon to mouth. By close of session, Patient able to hold container with L hand and use R hand to scoop food."
  },
  {
    "category": "TOILETING",
    "intervention": "Toileting: Transfer Training (Standard Commode)",
    "narrative": "Toileting routine with toilet transfer training performed. Instruction in stand-pivot technique with proper weight shifting and grab bar use provided. Hand-held assist when ambulating 20 feet to standard commode. Min assist and grab bar required for sit<>stand, 2/2 low commode height."
  },
  {
    "category": "TOILETING",
    "intervention": "Toileting: Adaptive Equipment (Raised Seat)",
    "narrative": "Toileting routine performed utilizing grab bar and raised toilet seat to improve [Patient Goal]. Min physical assist to facilitate standing from w/c with verbal cues for safe SPT w/c<>raised commode. Mod physical assist required for clothing management, 2/2 decreased LUE motor control."
  },
  {
    "category": "TOILETING",
    "intervention": "Toileting: Clothing Management (Seated)",
    "narrative": "Toilet transfer and hygiene with clothing management training completed. Instruction in seated garment management techniques provided. Max assist for pivot transfer from bed to bedside commode, 2/2 BLE paralysis. Patient able to participate in clothing adjustment with hand-over-hand guidance vs total assist at baseline."
  },
  {
    "category": "TOILETING",
    "intervention": "Toileting: Safety & Mobility",
    "narrative": "Toileting tasks in bathroom performed. Patient ambulated 15 ft with RW and SBA. Min assist required for sit<>stand from toilet. Tactile cues to gluteals to ensure proper seating. CGA to manage clothing over B LEs, 2/2 poor balance increasing fall risk."
  },
  {
    "category": "TOILETING",
    "intervention": "Toileting: Hygiene Techniques (Adaptive Tools)",
    "narrative": "Commode transfer post-toileting with hygiene technique training completed. Instruction in toilet paper management and extended reach wiping methods with adaptive tools provided. Mod physical assist to complete SPT with RW. Physical assist for hygiene tasks, 2/2 decreased endurance limiting sustained activity performance."
  },
  {
    "category": "TOILETING",
    "intervention": "Toileting & LB Dressing (Complex Task)",
    "narrative": "Patient facilitated in toileting routine and LB dressing tasks to improve [Patient Goal]. Hand-held assist when ambulating 30 feet to standard commode. Min assist and grab bar required for sit<>stand, 2/2 low commode height. CGA for clothing management. Seated on firm surface without back support, Patient able to donn pants with drawstring waistband with min assist and RW to assume standing posture. Verbal cues for improved ankle strategies when doffing pants, 2/2 decreased hip flexion ROM."
  },
  {
    "category": "TOILETING",
    "intervention": "Toileting: Hygiene (Max Assist)",
    "narrative": "Toileting routine performed utilizing grab bar and raised commode. Min physical assist to facilitate standing from w/c with min verbal cues for safe SPT w/c<>raised commode. Patient verbalized difficulty performing LB hygiene tasks; compensatory strategies implemented. Patient required max assist for hygiene tasks, 2/2 difficulty reaching perineal area."
  },
  {
    "category": "TOILETING",
    "intervention": "Toileting: Complex (Cognitive Deficits)",
    "narrative": "Patient facilitated in toileting routine, brief change/management, and UB dressing to promote [Patient Goal]. Moderate physical assistance with verbal and visual cues required to complete toileting tasks safely, 2/2 difficulty pivoting, cleaning the body, adjusting clothing, and obtaining supplies. Decreased safety awareness noted."
  },
  {
    "category": "GROOMING",
    "intervention": "Grooming: Technique Instruction (Oral Care)",
    "narrative": "Grooming tasks with technique instruction in proper toothbrushing performed to establish proper motor patterns. Demonstration of proper technique and verbal cues for sequencing provided. W/c seating required, 2/2 poor standing tolerance. Min assist to manage toothpaste on brush. Patient able to complete oral care with improved technique, 8/10 surfaces addressed vs 5/10 at baseline."
  },
  {
    "category": "GROOMING",
    "intervention": "Grooming: Adaptive Equipment (Long-Handled Tools)",
    "narrative": "UB hygiene with instruction in use of long-handled tools completed. Instruction in long-handled brush use for hair care provided. Patient used bedside table for BUE support. Min physical assist to complete combing back of head, 2/2 decreased shoulder ROM limiting overhead reach. Patient completed 75% of task independently with adaptive equipment."
  },
  {
    "category": "GROOMING",
    "intervention": "Grooming: Graded Cueing (Apraxia)",
    "narrative": "Oral care and facial hygiene with graded cueing hierarchy performed to improve [Patient Goal]. Physical guidance with fading assistance to bring toothbrush to mouth, 2/2 apraxia impairing motor planning. Tactile cues to cheeks and chin during face washing. Patient required mod physical assist initially, progressed to min verbal cues by close of session."
  },
  {
    "category": "GROOMING",
    "intervention": "Grooming: Safety (Shaving)",
    "narrative": "Shaving with safety training completed. Demonstration of electric razor use and instruction in safe technique provided, 2/2 visual field deficit impacting safety awareness. CGA required for safety to ensure all areas addressed. Patient able to hold razor and operate independently. Completed task seated in w/c with SBA."
  },
  {
    "category": "GROOMING",
    "intervention": "Grooming: Energy Conservation (Standing)",
    "narrative": "Full grooming routine (oral care, hair, face) with energy conservation training completed. Instruction in seated techniques and pacing provided. Patient stood at sink with RW for 5 minutes vs 2 minutes at baseline. Min assist for reaching and item management. Patient demonstrated improved activity tolerance with 1 rest break."
  },
  {
    "category": "GROOMING",
    "intervention": "Grooming: Sustained Performance (Maintenance)",
    "narrative": "Maintained grooming and hygiene skills demonstrated with use of adaptive equipment. Patient able to complete oral care, face washing, and hair care seated at sink with built-up handled tools and SBA. Min assist required for items requiring bilateral manipulation including toothpaste tube. Patient demonstrated proper sequencing and safety awareness throughout 12-minute grooming routine."
  },
  {
    "category": "GROOMING",
    "intervention": "Grooming: Decline (Progressive Deficits)",
    "narrative": "Declining grooming performance noted, 2/2 progressive cognitive and motor deficits. Mod-max verbal cues now required for sequencing basic hygiene tasks compared to min cues at baseline. Patient demonstrated difficulty with motor planning for oral care, requiring hand-over-hand guidance for 50% of task. Safety awareness decreased, requiring constant supervision."
  },
  {
    "category": "IADL",
    "intervention": "IADL: Meal Prep (Planning Skills)",
    "narrative": "Light meal prep (sandwich making) completed to improve [Patient Goal]. Task analysis and breakdown practice provided while seated, 2/2 decreased standing tolerance. Min assist to open containers and retrieve items. Patient able to demonstrate 4-step sequence independently vs 2 steps at baseline."
  },
  {
    "category": "IADL",
    "intervention": "IADL: Medication Management (Decision Making)",
    "narrative": "Medication management with decision-making skills training performed. Instruction in supply selection and product usage decisions for 7-day pill organizer provided. Graded cues required to accurately fill organizer, 2/2 cognitive deficits affecting task sequencing and safety judgment. Mod physical assist for opening bottles. Patient correctly identified 2 of 4 medications."
  },
  {
    "category": "IADL",
    "intervention": "IADL: Light Housekeeping (Safety)",
    "narrative": "To reduce fall risk during IADLs, light housekeeping performed. Instruction in balance preservation strategies provided while wiping counters standing with RW support. CGA for safety and balance. Tactile cues to trunk required to prevent loss of balance during reaching tasks."
  },
  {
    "category": "IADL",
    "intervention": "IADL: Retrieving Items (Reacher)",
    "narrative": "Item retrieval with instruction in reacher use completed to improve [Patient Goal]. Instruction provided to obtain light items from cabinet while seated in w/c. Min assist to maneuver w/c in tight spaces. Patient able to retrieve 3 of 4 items independently with reacher vs 0/4 at baseline."
  },
  {
    "category": "IADL",
    "intervention": "IADL: Meal Prep (Energy Conservation)",
    "narrative": "Simple cold meal preparation with energy conservation training performed. Instruction in activity pacing and work simplification strategies for pouring milk into cereal provided. Patient carried bowl and milk to table with min assist using RW basket, 2/2 impaired balance. Patient completed task with 1 rest break vs inability to complete at baseline."
  },
  {
    "category": "IADL",
    "intervention": "IADL: Housekeeping (Scooting)",
    "narrative": "Lateral scooting tasks to R and L sides (EOB) performed to increase trunk stability and gross motor coordination for [Patient Goal]. Mod assist required for sequencing of task and proper hand/foot placement to improve task performance, secondary to decreased BUE strength."
  },
  {
    "category": "IADL",
    "intervention": "IADL: Housekeeping (Standing)",
    "narrative": "Light housekeeping task (e.g., folding laundry) performed while standing (unsupported/supported with RW) to increase functional activity tolerance. Patient educated on energy conservation/work simplification techniques, with min verbal cues for activity pacing. Min assist required to maintain standing balance, 2/2 loss of balance x2."
  },
  {
    "category": "IADL",
    "intervention": "IADL: Maintenance (Compensatory Strategies)",
    "narrative": "Maintained IADL performance demonstrated with environmental modifications and adaptive strategies. Patient able to complete light meal prep seated at table with items within reach and min assist for heavy lifting. Medication management maintained with use of pre-filled organizer and written schedule. Patient able to manage simple cleaning tasks with long-handled tools and frequent rest breaks."
  },
  {
    "category": "IADL",
    "intervention": "IADL: Decline (Cognitive/Physical)",
    "narrative": "Declining performance in home management tasks noted, 2/2 progressive cognitive and physical decline. Meal preparation now requires mod-max assist compared to min assist at baseline. Patient demonstrated difficulty with sequencing multi-step tasks, completing only 2 of 5 steps independently. Safety concerns noted with stove use, requiring constant supervision."
  },
  {
    "category": "IADL",
    "intervention": "IADL: Medication Management (Maintenance)",
    "narrative": "Maintained medication management skills demonstrated with compensatory strategies in place. Patient able to identify correct medications and dosing schedule with use of pre-filled weekly organizer and written instructions. Min verbal cues required to check medication list against bottles. Patient correctly self-administered medications from organizer with SBA for safety."
  }
]